MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamv71q21rt/thirdparty/atsamv71q21rt/component/pwm.h
/* -------- PWM_CMPMUPD : (PWM Offset: 0x0C) ( /W 32) PWM Comparison 0 Mode Up2025-05-27 Register -------- */
#define PWM_CMPMUPD_CENUPD_Pos                _UINT32_(0)                                          /* (PWM_CMPMUPD) Comparison x Enable Up2025-05-27 Position */
#define PWM_CMPMUPD_CENUPD_Msk                (_UINT32_(0x1) << PWM_CMPMUPD_CENUPD_Pos)            /* (PWM_CMPMUPD) Comparison x Enable Up2025-05-27 Mask */
#define PWM_CMPMUPD_CENUPD(value)             (PWM_CMPMUPD_CENUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CENUPD_Pos)) /* Assignment of value for CENUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_CTRUPD_Pos                _UINT32_(4)                                          /* (PWM_CMPMUPD) Comparison x Trigger Up2025-05-27 Position */
#define PWM_CMPMUPD_CTRUPD_Msk                (_UINT32_(0xF) << PWM_CMPMUPD_CTRUPD_Pos)            /* (PWM_CMPMUPD) Comparison x Trigger Up2025-05-27 Mask */
#define PWM_CMPMUPD_CTRUPD(value)             (PWM_CMPMUPD_CTRUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CTRUPD_Pos)) /* Assignment of value for CTRUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_CPRUPD_Pos                _UINT32_(8)                                          /* (PWM_CMPMUPD) Comparison x Period Up2025-05-27 Position */
#define PWM_CMPMUPD_CPRUPD_Msk                (_UINT32_(0xF) << PWM_CMPMUPD_CPRUPD_Pos)            /* (PWM_CMPMUPD) Comparison x Period Up2025-05-27 Mask */
#define PWM_CMPMUPD_CPRUPD(value)             (PWM_CMPMUPD_CPRUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CPRUPD_Pos)) /* Assignment of value for CPRUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_CUPRUPD_Pos               _UINT32_(16)                                         /* (PWM_CMPMUPD) Comparison x Up2025-05-27 Period Up2025-05-27 Position */
#define PWM_CMPMUPD_CUPRUPD_Msk               (_UINT32_(0xF) << PWM_CMPMUPD_CUPRUPD_Pos)           /* (PWM_CMPMUPD) Comparison x Up2025-05-27 Period Up2025-05-27 Mask */
#define PWM_CMPMUPD_CUPRUPD(value)            (PWM_CMPMUPD_CUPRUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CUPRUPD_Pos)) /* Assignment of value for CUPRUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_Msk                       _UINT32_(0x000F0FF1)                                 /* (PWM_CMPMUPD) Register Mask  */


/* -------- PWM_CLK : (PWM Offset: 0x00) (R/W 32) PWM Clock Register -------- */
#define PWM_CLK_DIVA_Pos                      _UINT32_(0)                                          /* (PWM_CLK) CLKA Divide Factor Position */
#define PWM_CLK_DIVA_Msk                      (_UINT32_(0xFF) << PWM_CLK_DIVA_Pos)                 /* (PWM_CLK) CLKA Divide Factor Mask */
#define PWM_CLK_DIVA(value)                   (PWM_CLK_DIVA_Msk & (_UINT32_(value) << PWM_CLK_DIVA_Pos)) /* Assignment of value for DIVA in the PWM_CLK register */
#define   PWM_CLK_DIVA_CLKA_POFF_Val          _UINT32_(0x0)                                        /* (PWM_CLK) CLKA clock is turned off  */
#define   PWM_CLK_DIVA_PREA_Val               _UINT32_(0x1)                                        /* (PWM_CLK) CLKA clock is clock selected by PREA  */
#define PWM_CLK_DIVA_CLKA_POFF                (PWM_CLK_DIVA_CLKA_POFF_Val << PWM_CLK_DIVA_Pos)     /* (PWM_CLK) CLKA clock is turned off Position */
#define PWM_CLK_DIVA_PREA                     (PWM_CLK_DIVA_PREA_Val << PWM_CLK_DIVA_Pos)          /* (PWM_CLK) CLKA clock is clock selected by PREA Position */
#define PWM_CLK_PREA_Pos                      _UINT32_(8)                                          /* (PWM_CLK) CLKA Source Clock Selection Position */
#define PWM_CLK_PREA_Msk                      (_UINT32_(0xF) << PWM_CLK_PREA_Pos)                  /* (PWM_CLK) CLKA Source Clock Selection Mask */
#define PWM_CLK_PREA(value)                   (PWM_CLK_PREA_Msk & (_UINT32_(value) << PWM_CLK_PREA_Pos)) /* Assignment of value for PREA in the PWM_CLK register */
#define   PWM_CLK_PREA_CLK_Val                _UINT32_(0x0)                                        /* (PWM_CLK) Peripheral clock  */
#define   PWM_CLK_PREA_CLK_DIV2_Val           _UINT32_(0x1)                                        /* (PWM_CLK) Peripheral clock/2  */
#define   PWM_CLK_PREA_CLK_DIV4_Val           _UINT32_(0x2)                                        /* (PWM_CLK) Peripheral clock/4  */
#define   PWM_CLK_PREA_CLK_DIV8_Val           _UINT32_(0x3)                                        /* (PWM_CLK) Peripheral clock/8  */
#define   PWM_CLK_PREA_CLK_DIV16_Val          _UINT32_(0x4)                                        /* (PWM_CLK) Peripheral clock/16  */
#define   PWM_CLK_PREA_CLK_DIV32_Val          _UINT32_(0x5)                                        /* (PWM_CLK) Peripheral clock/32  */
#define   PWM_CLK_PREA_CLK_DIV64_Val          _UINT32_(0x6)                                        /* (PWM_CLK) Peripheral clock/64  */
#define   PWM_CLK_PREA_CLK_DIV128_Val         _UINT32_(0x7)                                        /* (PWM_CLK) Peripheral clock/128  */
#define   PWM_CLK_PREA_CLK_DIV256_Val         _UINT32_(0x8)                                        /* (PWM_CLK) Peripheral clock/256  */
#define   PWM_CLK_PREA_CLK_DIV512_Val         _UINT32_(0x9)                                        /* (PWM_CLK) Peripheral clock/512  */
#define   PWM_CLK_PREA_CLK_DIV1024_Val        _UINT32_(0xA)                                        /* (PWM_CLK) Peripheral clock/1024  */
#define PWM_CLK_PREA_CLK                      (PWM_CLK_PREA_CLK_Val << PWM_CLK_PREA_Pos)           /* (PWM_CLK) Peripheral clock Position */
#define PWM_CLK_PREA_CLK_DIV2                 (PWM_CLK_PREA_CLK_DIV2_Val << PWM_CLK_PREA_Pos)      /* (PWM_CLK) Peripheral clock/2 Position */
#define PWM_CLK_PREA_CLK_DIV4                 (PWM_CLK_PREA_CLK_DIV4_Val << PWM_CLK_PREA_Pos)      /* (PWM_CLK) Peripheral clock/4 Position */
#define PWM_CLK_PREA_CLK_DIV8                 (PWM_CLK_PREA_CLK_DIV8_Val << PWM_CLK_PREA_Pos)      /* (PWM_CLK) Peripheral clock/8 Position */
#define PWM_CLK_PREA_CLK_DIV16                (PWM_CLK_PREA_CLK_DIV16_Val << PWM_CLK_PREA_Pos)     /* (PWM_CLK) Peripheral clock/16 Position */
#define PWM_CLK_PREA_CLK_DIV32                (PWM_CLK_PREA_CLK_DIV32_Val << PWM_CLK_PREA_Pos)     /* (PWM_CLK) Peripheral clock/32 Position */
#define PWM_CLK_PREA_CLK_DIV64                (PWM_CLK_PREA_CLK_DIV64_Val << PWM_CLK_PREA_Pos)     /* (PWM_CLK) Peripheral clock/64 Position */
#define PWM_CLK_PREA_CLK_DIV128               (PWM_CLK_PREA_CLK_DIV128_Val << PWM_CLK_PREA_Pos)    /* (PWM_CLK) Peripheral clock/128 Position */
#define PWM_CLK_PREA_CLK_DIV256               (PWM_CLK_PREA_CLK_DIV256_Val << PWM_CLK_PREA_Pos)    /* (PWM_CLK) Peripheral clock/256 Position */
#define PWM_CLK_PREA_CLK_DIV512               (PWM_CLK_PREA_CLK_DIV512_Val << PWM_CLK_PREA_Pos)    /* (PWM_CLK) Peripheral clock/512 Position */
#define PWM_CLK_PREA_CLK_DIV1024              (PWM_CLK_PREA_CLK_DIV1024_Val << PWM_CLK_PREA_Pos)   /* (PWM_CLK) Peripheral clock/1024 Position */
#define PWM_CLK_DIVB_Pos                      _UINT32_(16)                                         /* (PWM_CLK) CLKB Divide Factor Position */
#define PWM_CLK_DIVB_Msk                      (_UINT32_(0xFF) << PWM_CLK_DIVB_Pos)                 /* (PWM_CLK) CLKB Divide Factor Mask */
#define PWM_CLK_DIVB(value)                   (PWM_CLK_DIVB_Msk & (_UINT32_(value) << PWM_CLK_DIVB_Pos)) /* Assignment of value for DIVB in the PWM_CLK register */
#define   PWM_CLK_DIVB_CLKB_POFF_Val          _UINT32_(0x0)                                        /* (PWM_CLK) CLKB clock is turned off  */
#define   PWM_CLK_DIVB_PREB_Val               _UINT32_(0x1)                                        /* (PWM_CLK) CLKB clock is clock selected by PREB  */
#define PWM_CLK_DIVB_CLKB_POFF                (PWM_CLK_DIVB_CLKB_POFF_Val << PWM_CLK_DIVB_Pos)     /* (PWM_CLK) CLKB clock is turned off Position */
#define PWM_CLK_DIVB_PREB                     (PWM_CLK_DIVB_PREB_Val << PWM_CLK_DIVB_Pos)          /* (PWM_CLK) CLKB clock is clock selected by PREB Position */
#define PWM_CLK_PREB_Pos                      _UINT32_(24)                                         /* (PWM_CLK) CLKB Source Clock Selection Position */
#define PWM_CLK_PREB_Msk                      (_UINT32_(0xF) << PWM_CLK_PREB_Pos)                  /* (PWM_CLK) CLKB Source Clock Selection Mask */
#define PWM_CLK_PREB(value)                   (PWM_CLK_PREB_Msk & (_UINT32_(value) << PWM_CLK_PREB_Pos)) /* Assignment of value for PREB in the PWM_CLK register */
#define   PWM_CLK_PREB_CLK_Val                _UINT32_(0x0)                                        /* (PWM_CLK) Peripheral clock  */
#define   PWM_CLK_PREB_CLK_DIV2_Val           _UINT32_(0x1)                                        /* (PWM_CLK) Peripheral clock/2  */
#define   PWM_CLK_PREB_CLK_DIV4_Val           _UINT32_(0x2)                                        /* (PWM_CLK) Peripheral clock/4  */
#define   PWM_CLK_PREB_CLK_DIV8_Val           _UINT32_(0x3)                                        /* (PWM_CLK) Peripheral clock/8  */
#define   PWM_CLK_PREB_CLK_DIV16_Val          _UINT32_(0x4)                                        /* (PWM_CLK) Peripheral clock/16  */
#define   PWM_CLK_PREB_CLK_DIV32_Val          _UINT32_(0x5)                                        /* (PWM_CLK) Peripheral clock/32  */
#define   PWM_CLK_PREB_CLK_DIV64_Val          _UINT32_(0x6)                                        /* (PWM_CLK) Peripheral clock/64  */
#define   PWM_CLK_PREB_CLK_DIV128_Val         _UINT32_(0x7)                                        /* (PWM_CLK) Peripheral clock/128  */
#define   PWM_CLK_PREB_CLK_DIV256_Val         _UINT32_(0x8)                                        /* (PWM_CLK) Peripheral clock/256  */
#define   PWM_CLK_PREB_CLK_DIV512_Val         _UINT32_(0x9)                                        /* (PWM_CLK) Peripheral clock/512  */
#define   PWM_CLK_PREB_CLK_DIV1024_Val        _UINT32_(0xA)                                        /* (PWM_CLK) Peripheral clock/1024  */
#define PWM_CLK_PREB_CLK                      (PWM_CLK_PREB_CLK_Val << PWM_CLK_PREB_Pos)           /* (PWM_CLK) Peripheral clock Position */
#define PWM_CLK_PREB_CLK_DIV2                 (PWM_CLK_PREB_CLK_DIV2_Val << PWM_CLK_PREB_Pos)      /* (PWM_CLK) Peripheral clock/2 Position */
#define PWM_CLK_PREB_CLK_DIV4                 (PWM_CLK_PREB_CLK_DIV4_Val << PWM_CLK_PREB_Pos)      /* (PWM_CLK) Peripheral clock/4 Position */
#define PWM_CLK_PREB_CLK_DIV8                 (PWM_CLK_PREB_CLK_DIV8_Val << PWM_CLK_PREB_Pos)      /* (PWM_CLK) Peripheral clock/8 Position */
#define PWM_CLK_PREB_CLK_DIV16                (PWM_CLK_PREB_CLK_DIV16_Val << PWM_CLK_PREB_Pos)     /* (PWM_CLK) Peripheral clock/16 Position */
#define PWM_CLK_PREB_CLK_DIV32                (PWM_CLK_PREB_CLK_DIV32_Val << PWM_CLK_PREB_Pos)     /* (PWM_CLK) Peripheral clock/32 Position */
#define PWM_CLK_PREB_CLK_DIV64                (PWM_CLK_PREB_CLK_DIV64_Val << PWM_CLK_PREB_Pos)     /* (PWM_CLK) Peripheral clock/64 Position */
#define PWM_CLK_PREB_CLK_DIV128               (PWM_CLK_PREB_CLK_DIV128_Val << PWM_CLK_PREB_Pos)    /* (PWM_CLK) Peripheral clock/128 Position */
#define PWM_CLK_PREB_CLK_DIV256               (PWM_CLK_PREB_CLK_DIV256_Val << PWM_CLK_PREB_Pos)    /* (PWM_CLK) Peripheral clock/256 Position */
#define PWM_CLK_PREB_CLK_DIV512               (PWM_CLK_PREB_CLK_DIV512_Val << PWM_CLK_PREB_Pos)    /* (PWM_CLK) Peripheral clock/512 Position */
#define PWM_CLK_PREB_CLK_DIV1024              (PWM_CLK_PREB_CLK_DIV1024_Val << PWM_CLK_PREB_Pos)   /* (PWM_CLK) Peripheral clock/1024 Position */
#define PWM_CLK_Msk                           _UINT32_(0x0FFF0FFF)                                 /* (PWM_CLK) Register Mask  */


/* -------- PWM_ENA : (PWM Offset: 0x04) ( /W 32) PWM Enable Register -------- */
#define PWM_ENA_CHID0_Pos                     _UINT32_(0)                                          /* (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID0_Msk                     (_UINT32_(0x1) << PWM_ENA_CHID0_Pos)                 /* (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID0(value)                  (PWM_ENA_CHID0_Msk & (_UINT32_(value) << PWM_ENA_CHID0_Pos)) /* Assignment of value for CHID0 in the PWM_ENA register */
#define PWM_ENA_CHID1_Pos                     _UINT32_(1)                                          /* (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID1_Msk                     (_UINT32_(0x1) << PWM_ENA_CHID1_Pos)                 /* (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID1(value)                  (PWM_ENA_CHID1_Msk & (_UINT32_(value) << PWM_ENA_CHID1_Pos)) /* Assignment of value for CHID1 in the PWM_ENA register */
#define PWM_ENA_CHID2_Pos                     _UINT32_(2)                                          /* (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID2_Msk                     (_UINT32_(0x1) << PWM_ENA_CHID2_Pos)                 /* (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID2(value)                  (PWM_ENA_CHID2_Msk & (_UINT32_(value) << PWM_ENA_CHID2_Pos)) /* Assignment of value for CHID2 in the PWM_ENA register */
#define PWM_ENA_CHID3_Pos                     _UINT32_(3)                                          /* (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID3_Msk                     (_UINT32_(0x1) << PWM_ENA_CHID3_Pos)                 /* (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID3(value)                  (PWM_ENA_CHID3_Msk & (_UINT32_(value) << PWM_ENA_CHID3_Pos)) /* Assignment of value for CHID3 in the PWM_ENA register */
#define PWM_ENA_Msk                           _UINT32_(0x0000000F)                                 /* (PWM_ENA) Register Mask  */

#define PWM_ENA_CHID_Pos                      _UINT32_(0)                                          /* (PWM_ENA Position) Channel ID */
#define PWM_ENA_CHID_Msk                      (_UINT32_(0xF) << PWM_ENA_CHID_Pos)                  /* (PWM_ENA Mask) CHID */
#define PWM_ENA_CHID(value)                   (PWM_ENA_CHID_Msk & (_UINT32_(value) << PWM_ENA_CHID_Pos)) 

/* -------- PWM_DIS : (PWM Offset: 0x08) ( /W 32) PWM Disable Register -------- */
#define PWM_DIS_CHID0_Pos                     _UINT32_(0)                                          /* (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID0_Msk                     (_UINT32_(0x1) << PWM_DIS_CHID0_Pos)                 /* (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID0(value)                  (PWM_DIS_CHID0_Msk & (_UINT32_(value) << PWM_DIS_CHID0_Pos)) /* Assignment of value for CHID0 in the PWM_DIS register */
#define PWM_DIS_CHID1_Pos                     _UINT32_(1)                                          /* (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID1_Msk                     (_UINT32_(0x1) << PWM_DIS_CHID1_Pos)                 /* (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID1(value)                  (PWM_DIS_CHID1_Msk & (_UINT32_(value) << PWM_DIS_CHID1_Pos)) /* Assignment of value for CHID1 in the PWM_DIS register */
#define PWM_DIS_CHID2_Pos                     _UINT32_(2)                                          /* (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID2_Msk                     (_UINT32_(0x1) << PWM_DIS_CHID2_Pos)                 /* (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID2(value)                  (PWM_DIS_CHID2_Msk & (_UINT32_(value) << PWM_DIS_CHID2_Pos)) /* Assignment of value for CHID2 in the PWM_DIS register */
#define PWM_DIS_CHID3_Pos                     _UINT32_(3)                                          /* (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID3_Msk                     (_UINT32_(0x1) << PWM_DIS_CHID3_Pos)                 /* (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID3(value)                  (PWM_DIS_CHID3_Msk & (_UINT32_(value) << PWM_DIS_CHID3_Pos)) /* Assignment of value for CHID3 in the PWM_DIS register */
#define PWM_DIS_Msk                           _UINT32_(0x0000000F)                                 /* (PWM_DIS) Register Mask  */

#define PWM_DIS_CHID_Pos                      _UINT32_(0)                                          /* (PWM_DIS Position) Channel ID */
#define PWM_DIS_CHID_Msk                      (_UINT32_(0xF) << PWM_DIS_CHID_Pos)                  /* (PWM_DIS Mask) CHID */
#define PWM_DIS_CHID(value)                   (PWM_DIS_CHID_Msk & (_UINT32_(value) << PWM_DIS_CHID_Pos)) 

/* -------- PWM_SR : (PWM Offset: 0x0C) ( R/ 32) PWM Status Register -------- */
#define PWM_SR_CHID0_Pos                      _UINT32_(0)                                          /* (PWM_SR) Channel ID Position */
#define PWM_SR_CHID0_Msk                      (_UINT32_(0x1) << PWM_SR_CHID0_Pos)                  /* (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID0(value)                   (PWM_SR_CHID0_Msk & (_UINT32_(value) << PWM_SR_CHID0_Pos)) /* Assignment of value for CHID0 in the PWM_SR register */
#define PWM_SR_CHID1_Pos                      _UINT32_(1)                                          /* (PWM_SR) Channel ID Position */
#define PWM_SR_CHID1_Msk                      (_UINT32_(0x1) << PWM_SR_CHID1_Pos)                  /* (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID1(value)                   (PWM_SR_CHID1_Msk & (_UINT32_(value) << PWM_SR_CHID1_Pos)) /* Assignment of value for CHID1 in the PWM_SR register */
#define PWM_SR_CHID2_Pos                      _UINT32_(2)                                          /* (PWM_SR) Channel ID Position */
#define PWM_SR_CHID2_Msk                      (_UINT32_(0x1) << PWM_SR_CHID2_Pos)                  /* (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID2(value)                   (PWM_SR_CHID2_Msk & (_UINT32_(value) << PWM_SR_CHID2_Pos)) /* Assignment of value for CHID2 in the PWM_SR register */
#define PWM_SR_CHID3_Pos                      _UINT32_(3)                                          /* (PWM_SR) Channel ID Position */
#define PWM_SR_CHID3_Msk                      (_UINT32_(0x1) << PWM_SR_CHID3_Pos)                  /* (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID3(value)                   (PWM_SR_CHID3_Msk & (_UINT32_(value) << PWM_SR_CHID3_Pos)) /* Assignment of value for CHID3 in the PWM_SR register */
#define PWM_SR_Msk                            _UINT32_(0x0000000F)                                 /* (PWM_SR) Register Mask  */

#define PWM_SR_CHID_Pos                       _UINT32_(0)                                          /* (PWM_SR Position) Channel ID */
#define PWM_SR_CHID_Msk                       (_UINT32_(0xF) << PWM_SR_CHID_Pos)                   /* (PWM_SR Mask) CHID */
#define PWM_SR_CHID(value)                    (PWM_SR_CHID_Msk & (_UINT32_(value) << PWM_SR_CHID_Pos)) 

/* -------- PWM_IER1 : (PWM Offset: 0x10) ( /W 32) PWM Interrupt Enable Register 1 -------- */
#define PWM_IER1_CHID0_Pos                    _UINT32_(0)                                          /* (PWM_IER1) Counter Event on Channel 0 Interrupt Enable Position */
#define PWM_IER1_CHID0_Msk                    (_UINT32_(0x1) << PWM_IER1_CHID0_Pos)                /* (PWM_IER1) Counter Event on Channel 0 Interrupt Enable Mask */
#define PWM_IER1_CHID0(value)                 (PWM_IER1_CHID0_Msk & (_UINT32_(value) << PWM_IER1_CHID0_Pos)) /* Assignment of value for CHID0 in the PWM_IER1 register */
#define PWM_IER1_CHID1_Pos                    _UINT32_(1)                                          /* (PWM_IER1) Counter Event on Channel 1 Interrupt Enable Position */
#define PWM_IER1_CHID1_Msk                    (_UINT32_(0x1) << PWM_IER1_CHID1_Pos)                /* (PWM_IER1) Counter Event on Channel 1 Interrupt Enable Mask */
#define PWM_IER1_CHID1(value)                 (PWM_IER1_CHID1_Msk & (_UINT32_(value) << PWM_IER1_CHID1_Pos)) /* Assignment of value for CHID1 in the PWM_IER1 register */
#define PWM_IER1_CHID2_Pos                    _UINT32_(2)                                          /* (PWM_IER1) Counter Event on Channel 2 Interrupt Enable Position */
#define PWM_IER1_CHID2_Msk                    (_UINT32_(0x1) << PWM_IER1_CHID2_Pos)                /* (PWM_IER1) Counter Event on Channel 2 Interrupt Enable Mask */
#define PWM_IER1_CHID2(value)                 (PWM_IER1_CHID2_Msk & (_UINT32_(value) << PWM_IER1_CHID2_Pos)) /* Assignment of value for CHID2 in the PWM_IER1 register */
#define PWM_IER1_CHID3_Pos                    _UINT32_(3)                                          /* (PWM_IER1) Counter Event on Channel 3 Interrupt Enable Position */
#define PWM_IER1_CHID3_Msk                    (_UINT32_(0x1) << PWM_IER1_CHID3_Pos)                /* (PWM_IER1) Counter Event on Channel 3 Interrupt Enable Mask */
#define PWM_IER1_CHID3(value)                 (PWM_IER1_CHID3_Msk & (_UINT32_(value) << PWM_IER1_CHID3_Pos)) /* Assignment of value for CHID3 in the PWM_IER1 register */
#define PWM_IER1_FCHID0_Pos                   _UINT32_(16)                                         /* (PWM_IER1) Fault Protection Trigger on Channel 0 Interrupt Enable Position */
#define PWM_IER1_FCHID0_Msk                   (_UINT32_(0x1) << PWM_IER1_FCHID0_Pos)               /* (PWM_IER1) Fault Protection Trigger on Channel 0 Interrupt Enable Mask */
#define PWM_IER1_FCHID0(value)                (PWM_IER1_FCHID0_Msk & (_UINT32_(value) << PWM_IER1_FCHID0_Pos)) /* Assignment of value for FCHID0 in the PWM_IER1 register */
#define PWM_IER1_FCHID1_Pos                   _UINT32_(17)                                         /* (PWM_IER1) Fault Protection Trigger on Channel 1 Interrupt Enable Position */
#define PWM_IER1_FCHID1_Msk                   (_UINT32_(0x1) << PWM_IER1_FCHID1_Pos)               /* (PWM_IER1) Fault Protection Trigger on Channel 1 Interrupt Enable Mask */
#define PWM_IER1_FCHID1(value)                (PWM_IER1_FCHID1_Msk & (_UINT32_(value) << PWM_IER1_FCHID1_Pos)) /* Assignment of value for FCHID1 in the PWM_IER1 register */
#define PWM_IER1_FCHID2_Pos                   _UINT32_(18)                                         /* (PWM_IER1) Fault Protection Trigger on Channel 2 Interrupt Enable Position */
#define PWM_IER1_FCHID2_Msk                   (_UINT32_(0x1) << PWM_IER1_FCHID2_Pos)               /* (PWM_IER1) Fault Protection Trigger on Channel 2 Interrupt Enable Mask */
#define PWM_IER1_FCHID2(value)                (PWM_IER1_FCHID2_Msk & (_UINT32_(value) << PWM_IER1_FCHID2_Pos)) /* Assignment of value for FCHID2 in the PWM_IER1 register */
#define PWM_IER1_FCHID3_Pos                   _UINT32_(19)                                         /* (PWM_IER1) Fault Protection Trigger on Channel 3 Interrupt Enable Position */
#define PWM_IER1_FCHID3_Msk                   (_UINT32_(0x1) << PWM_IER1_FCHID3_Pos)               /* (PWM_IER1) Fault Protection Trigger on Channel 3 Interrupt Enable Mask */
#define PWM_IER1_FCHID3(value)                (PWM_IER1_FCHID3_Msk & (_UINT32_(value) << PWM_IER1_FCHID3_Pos)) /* Assignment of value for FCHID3 in the PWM_IER1 register */
#define PWM_IER1_Msk                          _UINT32_(0x000F000F)                                 /* (PWM_IER1) Register Mask  */

#define PWM_IER1_CHID_Pos                     _UINT32_(0)                                          /* (PWM_IER1 Position) Counter Event on Channel x Interrupt Enable */
#define PWM_IER1_CHID_Msk                     (_UINT32_(0xF) << PWM_IER1_CHID_Pos)                 /* (PWM_IER1 Mask) CHID */
#define PWM_IER1_CHID(value)                  (PWM_IER1_CHID_Msk & (_UINT32_(value) << PWM_IER1_CHID_Pos)) 
#define PWM_IER1_FCHID_Pos                    _UINT32_(16)                                         /* (PWM_IER1 Position) Fault Protection Trigger on Channel 3 Interrupt Enable */
#define PWM_IER1_FCHID_Msk                    (_UINT32_(0xF) << PWM_IER1_FCHID_Pos)                /* (PWM_IER1 Mask) FCHID */
#define PWM_IER1_FCHID(value)                 (PWM_IER1_FCHID_Msk & (_UINT32_(value) << PWM_IER1_FCHID_Pos)) 

