MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamv71q21rt/thirdparty/atsamv71q21rt/component/pwm.h
/* -------- PWM_SCM : (PWM Offset: 0x20) (R/W 32) PWM Sync Channels Mode Register -------- */
#define PWM_SCM_SYNC0_Pos                     _UINT32_(0)                                          /* (PWM_SCM) Synchronous Channel 0 Position */
#define PWM_SCM_SYNC0_Msk                     (_UINT32_(0x1) << PWM_SCM_SYNC0_Pos)                 /* (PWM_SCM) Synchronous Channel 0 Mask */
#define PWM_SCM_SYNC0(value)                  (PWM_SCM_SYNC0_Msk & (_UINT32_(value) << PWM_SCM_SYNC0_Pos)) /* Assignment of value for SYNC0 in the PWM_SCM register */
#define PWM_SCM_SYNC1_Pos                     _UINT32_(1)                                          /* (PWM_SCM) Synchronous Channel 1 Position */
#define PWM_SCM_SYNC1_Msk                     (_UINT32_(0x1) << PWM_SCM_SYNC1_Pos)                 /* (PWM_SCM) Synchronous Channel 1 Mask */
#define PWM_SCM_SYNC1(value)                  (PWM_SCM_SYNC1_Msk & (_UINT32_(value) << PWM_SCM_SYNC1_Pos)) /* Assignment of value for SYNC1 in the PWM_SCM register */
#define PWM_SCM_SYNC2_Pos                     _UINT32_(2)                                          /* (PWM_SCM) Synchronous Channel 2 Position */
#define PWM_SCM_SYNC2_Msk                     (_UINT32_(0x1) << PWM_SCM_SYNC2_Pos)                 /* (PWM_SCM) Synchronous Channel 2 Mask */
#define PWM_SCM_SYNC2(value)                  (PWM_SCM_SYNC2_Msk & (_UINT32_(value) << PWM_SCM_SYNC2_Pos)) /* Assignment of value for SYNC2 in the PWM_SCM register */
#define PWM_SCM_SYNC3_Pos                     _UINT32_(3)                                          /* (PWM_SCM) Synchronous Channel 3 Position */
#define PWM_SCM_SYNC3_Msk                     (_UINT32_(0x1) << PWM_SCM_SYNC3_Pos)                 /* (PWM_SCM) Synchronous Channel 3 Mask */
#define PWM_SCM_SYNC3(value)                  (PWM_SCM_SYNC3_Msk & (_UINT32_(value) << PWM_SCM_SYNC3_Pos)) /* Assignment of value for SYNC3 in the PWM_SCM register */
#define PWM_SCM_UPDM_Pos                      _UINT32_(16)                                         /* (PWM_SCM) Synchronous Channels Up2025-05-27 Mode Position */
#define PWM_SCM_UPDM_Msk                      (_UINT32_(0x3) << PWM_SCM_UPDM_Pos)                  /* (PWM_SCM) Synchronous Channels Up2025-05-27 Mode Mask */
#define PWM_SCM_UPDM(value)                   (PWM_SCM_UPDM_Msk & (_UINT32_(value) << PWM_SCM_UPDM_Pos)) /* Assignment of value for UPDM in the PWM_SCM register */
#define   PWM_SCM_UPDM_MODE0_Val              _UINT32_(0x0)                                        /* (PWM_SCM) Manual write of double buffer registers and manual up2025-05-27 of synchronous channels  */
#define   PWM_SCM_UPDM_MODE1_Val              _UINT32_(0x1)                                        /* (PWM_SCM) Manual write of double buffer registers and automatic up2025-05-27 of synchronous channels  */
#define   PWM_SCM_UPDM_MODE2_Val              _UINT32_(0x2)                                        /* (PWM_SCM) Automatic write of duty-cycle up2025-05-27 registers by the DMA Controller and automatic up2025-05-27 of synchronous channels  */
#define PWM_SCM_UPDM_MODE0                    (PWM_SCM_UPDM_MODE0_Val << PWM_SCM_UPDM_Pos)         /* (PWM_SCM) Manual write of double buffer registers and manual up2025-05-27 of synchronous channels Position */
#define PWM_SCM_UPDM_MODE1                    (PWM_SCM_UPDM_MODE1_Val << PWM_SCM_UPDM_Pos)         /* (PWM_SCM) Manual write of double buffer registers and automatic up2025-05-27 of synchronous channels Position */
#define PWM_SCM_UPDM_MODE2                    (PWM_SCM_UPDM_MODE2_Val << PWM_SCM_UPDM_Pos)         /* (PWM_SCM) Automatic write of duty-cycle up2025-05-27 registers by the DMA Controller and automatic up2025-05-27 of synchronous channels Position */
#define PWM_SCM_PTRM_Pos                      _UINT32_(20)                                         /* (PWM_SCM) DMA Controller Transfer Request Mode Position */
#define PWM_SCM_PTRM_Msk                      (_UINT32_(0x1) << PWM_SCM_PTRM_Pos)                  /* (PWM_SCM) DMA Controller Transfer Request Mode Mask */
#define PWM_SCM_PTRM(value)                   (PWM_SCM_PTRM_Msk & (_UINT32_(value) << PWM_SCM_PTRM_Pos)) /* Assignment of value for PTRM in the PWM_SCM register */
#define PWM_SCM_PTRCS_Pos                     _UINT32_(21)                                         /* (PWM_SCM) DMA Controller Transfer Request Comparison Selection Position */
#define PWM_SCM_PTRCS_Msk                     (_UINT32_(0x7) << PWM_SCM_PTRCS_Pos)                 /* (PWM_SCM) DMA Controller Transfer Request Comparison Selection Mask */
#define PWM_SCM_PTRCS(value)                  (PWM_SCM_PTRCS_Msk & (_UINT32_(value) << PWM_SCM_PTRCS_Pos)) /* Assignment of value for PTRCS in the PWM_SCM register */
#define PWM_SCM_Msk                           _UINT32_(0x00F3000F)                                 /* (PWM_SCM) Register Mask  */

#define PWM_SCM_SYNC_Pos                      _UINT32_(0)                                          /* (PWM_SCM Position) Synchronous Channel x */
#define PWM_SCM_SYNC_Msk                      (_UINT32_(0xF) << PWM_SCM_SYNC_Pos)                  /* (PWM_SCM Mask) SYNC */
#define PWM_SCM_SYNC(value)                   (PWM_SCM_SYNC_Msk & (_UINT32_(value) << PWM_SCM_SYNC_Pos)) 

/* -------- PWM_DMAR : (PWM Offset: 0x24) ( /W 32) PWM DMA Register -------- */
#define PWM_DMAR_DMADUTY_Pos                  _UINT32_(0)                                          /* (PWM_DMAR) Duty-Cycle Holding Register for DMA Access Position */
#define PWM_DMAR_DMADUTY_Msk                  (_UINT32_(0xFFFFFF) << PWM_DMAR_DMADUTY_Pos)         /* (PWM_DMAR) Duty-Cycle Holding Register for DMA Access Mask */
#define PWM_DMAR_DMADUTY(value)               (PWM_DMAR_DMADUTY_Msk & (_UINT32_(value) << PWM_DMAR_DMADUTY_Pos)) /* Assignment of value for DMADUTY in the PWM_DMAR register */
#define PWM_DMAR_Msk                          _UINT32_(0x00FFFFFF)                                 /* (PWM_DMAR) Register Mask  */


/* -------- PWM_SCUC : (PWM Offset: 0x28) (R/W 32) PWM Sync Channels Up2025-05-27 Control Register -------- */
#define PWM_SCUC_UPDULOCK_Pos                 _UINT32_(0)                                          /* (PWM_SCUC) Synchronous Channels Up2025-05-27 Unlock Position */
#define PWM_SCUC_UPDULOCK_Msk                 (_UINT32_(0x1) << PWM_SCUC_UPDULOCK_Pos)             /* (PWM_SCUC) Synchronous Channels Up2025-05-27 Unlock Mask */
#define PWM_SCUC_UPDULOCK(value)              (PWM_SCUC_UPDULOCK_Msk & (_UINT32_(value) << PWM_SCUC_UPDULOCK_Pos)) /* Assignment of value for UPDULOCK in the PWM_SCUC register */
#define PWM_SCUC_Msk                          _UINT32_(0x00000001)                                 /* (PWM_SCUC) Register Mask  */


/* -------- PWM_SCUP : (PWM Offset: 0x2C) (R/W 32) PWM Sync Channels Up2025-05-27 Period Register -------- */
#define PWM_SCUP_UPR_Pos                      _UINT32_(0)                                          /* (PWM_SCUP) Up2025-05-27 Period Position */
#define PWM_SCUP_UPR_Msk                      (_UINT32_(0xF) << PWM_SCUP_UPR_Pos)                  /* (PWM_SCUP) Up2025-05-27 Period Mask */
#define PWM_SCUP_UPR(value)                   (PWM_SCUP_UPR_Msk & (_UINT32_(value) << PWM_SCUP_UPR_Pos)) /* Assignment of value for UPR in the PWM_SCUP register */
#define PWM_SCUP_UPRCNT_Pos                   _UINT32_(4)                                          /* (PWM_SCUP) Up2025-05-27 Period Counter Position */
#define PWM_SCUP_UPRCNT_Msk                   (_UINT32_(0xF) << PWM_SCUP_UPRCNT_Pos)               /* (PWM_SCUP) Up2025-05-27 Period Counter Mask */
#define PWM_SCUP_UPRCNT(value)                (PWM_SCUP_UPRCNT_Msk & (_UINT32_(value) << PWM_SCUP_UPRCNT_Pos)) /* Assignment of value for UPRCNT in the PWM_SCUP register */
#define PWM_SCUP_Msk                          _UINT32_(0x000000FF)                                 /* (PWM_SCUP) Register Mask  */


/* -------- PWM_SCUPUPD : (PWM Offset: 0x30) ( /W 32) PWM Sync Channels Up2025-05-27 Period Up2025-05-27 Register -------- */
#define PWM_SCUPUPD_UPRUPD_Pos                _UINT32_(0)                                          /* (PWM_SCUPUPD) Up2025-05-27 Period Up2025-05-27 Position */
#define PWM_SCUPUPD_UPRUPD_Msk                (_UINT32_(0xF) << PWM_SCUPUPD_UPRUPD_Pos)            /* (PWM_SCUPUPD) Up2025-05-27 Period Up2025-05-27 Mask */
#define PWM_SCUPUPD_UPRUPD(value)             (PWM_SCUPUPD_UPRUPD_Msk & (_UINT32_(value) << PWM_SCUPUPD_UPRUPD_Pos)) /* Assignment of value for UPRUPD in the PWM_SCUPUPD register */
#define PWM_SCUPUPD_Msk                       _UINT32_(0x0000000F)                                 /* (PWM_SCUPUPD) Register Mask  */


