MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamv71q21rt/thirdparty/atsamv71q21rt/component/pwm.h
/* -------- PWM_OSSUPD : (PWM Offset: 0x54) ( /W 32) PWM Output Selection Set Up2025-05-27 Register -------- */
#define PWM_OSSUPD_OSSUPH0_Pos                _UINT32_(0)                                          /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 0 Position */
#define PWM_OSSUPD_OSSUPH0_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPH0_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 0 Mask */
#define PWM_OSSUPD_OSSUPH0(value)             (PWM_OSSUPD_OSSUPH0_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPH0_Pos)) /* Assignment of value for OSSUPH0 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPH1_Pos                _UINT32_(1)                                          /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 1 Position */
#define PWM_OSSUPD_OSSUPH1_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPH1_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 1 Mask */
#define PWM_OSSUPD_OSSUPH1(value)             (PWM_OSSUPD_OSSUPH1_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPH1_Pos)) /* Assignment of value for OSSUPH1 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPH2_Pos                _UINT32_(2)                                          /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 2 Position */
#define PWM_OSSUPD_OSSUPH2_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPH2_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 2 Mask */
#define PWM_OSSUPD_OSSUPH2(value)             (PWM_OSSUPD_OSSUPH2_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPH2_Pos)) /* Assignment of value for OSSUPH2 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPH3_Pos                _UINT32_(3)                                          /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 3 Position */
#define PWM_OSSUPD_OSSUPH3_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPH3_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 3 Mask */
#define PWM_OSSUPD_OSSUPH3(value)             (PWM_OSSUPD_OSSUPH3_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPH3_Pos)) /* Assignment of value for OSSUPH3 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPL0_Pos                _UINT32_(16)                                         /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 0 Position */
#define PWM_OSSUPD_OSSUPL0_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPL0_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 0 Mask */
#define PWM_OSSUPD_OSSUPL0(value)             (PWM_OSSUPD_OSSUPL0_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPL0_Pos)) /* Assignment of value for OSSUPL0 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPL1_Pos                _UINT32_(17)                                         /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 1 Position */
#define PWM_OSSUPD_OSSUPL1_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPL1_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 1 Mask */
#define PWM_OSSUPD_OSSUPL1(value)             (PWM_OSSUPD_OSSUPL1_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPL1_Pos)) /* Assignment of value for OSSUPL1 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPL2_Pos                _UINT32_(18)                                         /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 2 Position */
#define PWM_OSSUPD_OSSUPL2_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPL2_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 2 Mask */
#define PWM_OSSUPD_OSSUPL2(value)             (PWM_OSSUPD_OSSUPL2_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPL2_Pos)) /* Assignment of value for OSSUPL2 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPL3_Pos                _UINT32_(19)                                         /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 3 Position */
#define PWM_OSSUPD_OSSUPL3_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPL3_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 3 Mask */
#define PWM_OSSUPD_OSSUPL3(value)             (PWM_OSSUPD_OSSUPL3_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPL3_Pos)) /* Assignment of value for OSSUPL3 in the PWM_OSSUPD register */
#define PWM_OSSUPD_Msk                        _UINT32_(0x000F000F)                                 /* (PWM_OSSUPD) Register Mask  */

#define PWM_OSSUPD_OSSUPH_Pos                 _UINT32_(0)                                          /* (PWM_OSSUPD Position) Output Selection Set for PWMH output of the channel x */
#define PWM_OSSUPD_OSSUPH_Msk                 (_UINT32_(0xF) << PWM_OSSUPD_OSSUPH_Pos)             /* (PWM_OSSUPD Mask) OSSUPH */
#define PWM_OSSUPD_OSSUPH(value)              (PWM_OSSUPD_OSSUPH_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPH_Pos)) 
#define PWM_OSSUPD_OSSUPL_Pos                 _UINT32_(16)                                         /* (PWM_OSSUPD Position) Output Selection Set for PWML output of the channel 3 */
#define PWM_OSSUPD_OSSUPL_Msk                 (_UINT32_(0xF) << PWM_OSSUPD_OSSUPL_Pos)             /* (PWM_OSSUPD Mask) OSSUPL */
#define PWM_OSSUPD_OSSUPL(value)              (PWM_OSSUPD_OSSUPL_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPL_Pos)) 

/* -------- PWM_OSCUPD : (PWM Offset: 0x58) ( /W 32) PWM Output Selection Clear Up2025-05-27 Register -------- */
#define PWM_OSCUPD_OSCUPH0_Pos                _UINT32_(0)                                          /* (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 0 Position */
#define PWM_OSCUPD_OSCUPH0_Msk                (_UINT32_(0x1) << PWM_OSCUPD_OSCUPH0_Pos)            /* (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 0 Mask */
#define PWM_OSCUPD_OSCUPH0(value)             (PWM_OSCUPD_OSCUPH0_Msk & (_UINT32_(value) << PWM_OSCUPD_OSCUPH0_Pos)) /* Assignment of value for OSCUPH0 in the PWM_OSCUPD register */
#define PWM_OSCUPD_OSCUPH1_Pos                _UINT32_(1)                                          /* (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 1 Position */
#define PWM_OSCUPD_OSCUPH1_Msk                (_UINT32_(0x1) << PWM_OSCUPD_OSCUPH1_Pos)            /* (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 1 Mask */
#define PWM_OSCUPD_OSCUPH1(value)             (PWM_OSCUPD_OSCUPH1_Msk & (_UINT32_(value) << PWM_OSCUPD_OSCUPH1_Pos)) /* Assignment of value for OSCUPH1 in the PWM_OSCUPD register */
#define PWM_OSCUPD_OSCUPH2_Pos                _UINT32_(2)                                          /* (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 2 Position */
#define PWM_OSCUPD_OSCUPH2_Msk                (_UINT32_(0x1) << PWM_OSCUPD_OSCUPH2_Pos)            /* (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 2 Mask */
#define PWM_OSCUPD_OSCUPH2(value)             (PWM_OSCUPD_OSCUPH2_Msk & (_UINT32_(value) << PWM_OSCUPD_OSCUPH2_Pos)) /* Assignment of value for OSCUPH2 in the PWM_OSCUPD register */
#define PWM_OSCUPD_OSCUPH3_Pos                _UINT32_(3)                                          /* (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 3 Position */
#define PWM_OSCUPD_OSCUPH3_Msk                (_UINT32_(0x1) << PWM_OSCUPD_OSCUPH3_Pos)            /* (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 3 Mask */
#define PWM_OSCUPD_OSCUPH3(value)             (PWM_OSCUPD_OSCUPH3_Msk & (_UINT32_(value) << PWM_OSCUPD_OSCUPH3_Pos)) /* Assignment of value for OSCUPH3 in the PWM_OSCUPD register */
#define PWM_OSCUPD_OSCUPL0_Pos                _UINT32_(16)                                         /* (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 0 Position */
#define PWM_OSCUPD_OSCUPL0_Msk                (_UINT32_(0x1) << PWM_OSCUPD_OSCUPL0_Pos)            /* (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 0 Mask */
#define PWM_OSCUPD_OSCUPL0(value)             (PWM_OSCUPD_OSCUPL0_Msk & (_UINT32_(value) << PWM_OSCUPD_OSCUPL0_Pos)) /* Assignment of value for OSCUPL0 in the PWM_OSCUPD register */
#define PWM_OSCUPD_OSCUPL1_Pos                _UINT32_(17)                                         /* (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 1 Position */
#define PWM_OSCUPD_OSCUPL1_Msk                (_UINT32_(0x1) << PWM_OSCUPD_OSCUPL1_Pos)            /* (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 1 Mask */
#define PWM_OSCUPD_OSCUPL1(value)             (PWM_OSCUPD_OSCUPL1_Msk & (_UINT32_(value) << PWM_OSCUPD_OSCUPL1_Pos)) /* Assignment of value for OSCUPL1 in the PWM_OSCUPD register */
#define PWM_OSCUPD_OSCUPL2_Pos                _UINT32_(18)                                         /* (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 2 Position */
#define PWM_OSCUPD_OSCUPL2_Msk                (_UINT32_(0x1) << PWM_OSCUPD_OSCUPL2_Pos)            /* (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 2 Mask */
#define PWM_OSCUPD_OSCUPL2(value)             (PWM_OSCUPD_OSCUPL2_Msk & (_UINT32_(value) << PWM_OSCUPD_OSCUPL2_Pos)) /* Assignment of value for OSCUPL2 in the PWM_OSCUPD register */
#define PWM_OSCUPD_OSCUPL3_Pos                _UINT32_(19)                                         /* (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 3 Position */
#define PWM_OSCUPD_OSCUPL3_Msk                (_UINT32_(0x1) << PWM_OSCUPD_OSCUPL3_Pos)            /* (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 3 Mask */
#define PWM_OSCUPD_OSCUPL3(value)             (PWM_OSCUPD_OSCUPL3_Msk & (_UINT32_(value) << PWM_OSCUPD_OSCUPL3_Pos)) /* Assignment of value for OSCUPL3 in the PWM_OSCUPD register */
#define PWM_OSCUPD_Msk                        _UINT32_(0x000F000F)                                 /* (PWM_OSCUPD) Register Mask  */

#define PWM_OSCUPD_OSCUPH_Pos                 _UINT32_(0)                                          /* (PWM_OSCUPD Position) Output Selection Clear for PWMH output of the channel x */
#define PWM_OSCUPD_OSCUPH_Msk                 (_UINT32_(0xF) << PWM_OSCUPD_OSCUPH_Pos)             /* (PWM_OSCUPD Mask) OSCUPH */
#define PWM_OSCUPD_OSCUPH(value)              (PWM_OSCUPD_OSCUPH_Msk & (_UINT32_(value) << PWM_OSCUPD_OSCUPH_Pos)) 
#define PWM_OSCUPD_OSCUPL_Pos                 _UINT32_(16)                                         /* (PWM_OSCUPD Position) Output Selection Clear for PWML output of the channel 3 */
#define PWM_OSCUPD_OSCUPL_Msk                 (_UINT32_(0xF) << PWM_OSCUPD_OSCUPL_Pos)             /* (PWM_OSCUPD Mask) OSCUPL */
#define PWM_OSCUPD_OSCUPL(value)              (PWM_OSCUPD_OSCUPL_Msk & (_UINT32_(value) << PWM_OSCUPD_OSCUPL_Pos)) 

