MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamv71q21rt/thirdparty/atsamv71q21rt/component/pwm.h
/* -------- PWM_SSPUP : (PWM Offset: 0xA4) ( /W 32) PWM Spread Spectrum Up2025-05-27 Register -------- */
#define PWM_SSPUP_SPRDUP_Pos                  _UINT32_(0)                                          /* (PWM_SSPUP) Spread Spectrum Limit Value Up2025-05-27 Position */
#define PWM_SSPUP_SPRDUP_Msk                  (_UINT32_(0xFFFFFF) << PWM_SSPUP_SPRDUP_Pos)         /* (PWM_SSPUP) Spread Spectrum Limit Value Up2025-05-27 Mask */
#define PWM_SSPUP_SPRDUP(value)               (PWM_SSPUP_SPRDUP_Msk & (_UINT32_(value) << PWM_SSPUP_SPRDUP_Pos)) /* Assignment of value for SPRDUP in the PWM_SSPUP register */
#define PWM_SSPUP_Msk                         _UINT32_(0x00FFFFFF)                                 /* (PWM_SSPUP) Register Mask  */


/* -------- PWM_SMMR : (PWM Offset: 0xB0) (R/W 32) PWM Stepper Motor Mode Register -------- */
#define PWM_SMMR_GCEN0_Pos                    _UINT32_(0)                                          /* (PWM_SMMR) Gray Count ENable Position */
#define PWM_SMMR_GCEN0_Msk                    (_UINT32_(0x1) << PWM_SMMR_GCEN0_Pos)                /* (PWM_SMMR) Gray Count ENable Mask */
#define PWM_SMMR_GCEN0(value)                 (PWM_SMMR_GCEN0_Msk & (_UINT32_(value) << PWM_SMMR_GCEN0_Pos)) /* Assignment of value for GCEN0 in the PWM_SMMR register */
#define PWM_SMMR_GCEN1_Pos                    _UINT32_(1)                                          /* (PWM_SMMR) Gray Count ENable Position */
#define PWM_SMMR_GCEN1_Msk                    (_UINT32_(0x1) << PWM_SMMR_GCEN1_Pos)                /* (PWM_SMMR) Gray Count ENable Mask */
#define PWM_SMMR_GCEN1(value)                 (PWM_SMMR_GCEN1_Msk & (_UINT32_(value) << PWM_SMMR_GCEN1_Pos)) /* Assignment of value for GCEN1 in the PWM_SMMR register */
#define PWM_SMMR_DOWN0_Pos                    _UINT32_(16)                                         /* (PWM_SMMR) DOWN Count Position */
#define PWM_SMMR_DOWN0_Msk                    (_UINT32_(0x1) << PWM_SMMR_DOWN0_Pos)                /* (PWM_SMMR) DOWN Count Mask */
#define PWM_SMMR_DOWN0(value)                 (PWM_SMMR_DOWN0_Msk & (_UINT32_(value) << PWM_SMMR_DOWN0_Pos)) /* Assignment of value for DOWN0 in the PWM_SMMR register */
#define PWM_SMMR_DOWN1_Pos                    _UINT32_(17)                                         /* (PWM_SMMR) DOWN Count Position */
#define PWM_SMMR_DOWN1_Msk                    (_UINT32_(0x1) << PWM_SMMR_DOWN1_Pos)                /* (PWM_SMMR) DOWN Count Mask */
#define PWM_SMMR_DOWN1(value)                 (PWM_SMMR_DOWN1_Msk & (_UINT32_(value) << PWM_SMMR_DOWN1_Pos)) /* Assignment of value for DOWN1 in the PWM_SMMR register */
#define PWM_SMMR_Msk                          _UINT32_(0x00030003)                                 /* (PWM_SMMR) Register Mask  */

#define PWM_SMMR_GCEN_Pos                     _UINT32_(0)                                          /* (PWM_SMMR Position) Gray Count ENable */
#define PWM_SMMR_GCEN_Msk                     (_UINT32_(0x3) << PWM_SMMR_GCEN_Pos)                 /* (PWM_SMMR Mask) GCEN */
#define PWM_SMMR_GCEN(value)                  (PWM_SMMR_GCEN_Msk & (_UINT32_(value) << PWM_SMMR_GCEN_Pos)) 
#define PWM_SMMR_DOWN_Pos                     _UINT32_(16)                                         /* (PWM_SMMR Position) DOWN Count */
#define PWM_SMMR_DOWN_Msk                     (_UINT32_(0x3) << PWM_SMMR_DOWN_Pos)                 /* (PWM_SMMR Mask) DOWN */
#define PWM_SMMR_DOWN(value)                  (PWM_SMMR_DOWN_Msk & (_UINT32_(value) << PWM_SMMR_DOWN_Pos)) 

/* -------- PWM_FPV2 : (PWM Offset: 0xC0) (R/W 32) PWM Fault Protection Value 2 Register -------- */
#define PWM_FPV2_FPZH0_Pos                    _UINT32_(0)                                          /* (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 0 Position */
#define PWM_FPV2_FPZH0_Msk                    (_UINT32_(0x1) << PWM_FPV2_FPZH0_Pos)                /* (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 0 Mask */
#define PWM_FPV2_FPZH0(value)                 (PWM_FPV2_FPZH0_Msk & (_UINT32_(value) << PWM_FPV2_FPZH0_Pos)) /* Assignment of value for FPZH0 in the PWM_FPV2 register */
#define PWM_FPV2_FPZH1_Pos                    _UINT32_(1)                                          /* (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 1 Position */
#define PWM_FPV2_FPZH1_Msk                    (_UINT32_(0x1) << PWM_FPV2_FPZH1_Pos)                /* (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 1 Mask */
#define PWM_FPV2_FPZH1(value)                 (PWM_FPV2_FPZH1_Msk & (_UINT32_(value) << PWM_FPV2_FPZH1_Pos)) /* Assignment of value for FPZH1 in the PWM_FPV2 register */
#define PWM_FPV2_FPZH2_Pos                    _UINT32_(2)                                          /* (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 2 Position */
#define PWM_FPV2_FPZH2_Msk                    (_UINT32_(0x1) << PWM_FPV2_FPZH2_Pos)                /* (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 2 Mask */
#define PWM_FPV2_FPZH2(value)                 (PWM_FPV2_FPZH2_Msk & (_UINT32_(value) << PWM_FPV2_FPZH2_Pos)) /* Assignment of value for FPZH2 in the PWM_FPV2 register */
#define PWM_FPV2_FPZH3_Pos                    _UINT32_(3)                                          /* (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 3 Position */
#define PWM_FPV2_FPZH3_Msk                    (_UINT32_(0x1) << PWM_FPV2_FPZH3_Pos)                /* (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 3 Mask */
#define PWM_FPV2_FPZH3(value)                 (PWM_FPV2_FPZH3_Msk & (_UINT32_(value) << PWM_FPV2_FPZH3_Pos)) /* Assignment of value for FPZH3 in the PWM_FPV2 register */
#define PWM_FPV2_FPZL0_Pos                    _UINT32_(16)                                         /* (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 0 Position */
#define PWM_FPV2_FPZL0_Msk                    (_UINT32_(0x1) << PWM_FPV2_FPZL0_Pos)                /* (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 0 Mask */
#define PWM_FPV2_FPZL0(value)                 (PWM_FPV2_FPZL0_Msk & (_UINT32_(value) << PWM_FPV2_FPZL0_Pos)) /* Assignment of value for FPZL0 in the PWM_FPV2 register */
#define PWM_FPV2_FPZL1_Pos                    _UINT32_(17)                                         /* (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 1 Position */
#define PWM_FPV2_FPZL1_Msk                    (_UINT32_(0x1) << PWM_FPV2_FPZL1_Pos)                /* (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 1 Mask */
#define PWM_FPV2_FPZL1(value)                 (PWM_FPV2_FPZL1_Msk & (_UINT32_(value) << PWM_FPV2_FPZL1_Pos)) /* Assignment of value for FPZL1 in the PWM_FPV2 register */
#define PWM_FPV2_FPZL2_Pos                    _UINT32_(18)                                         /* (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 2 Position */
#define PWM_FPV2_FPZL2_Msk                    (_UINT32_(0x1) << PWM_FPV2_FPZL2_Pos)                /* (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 2 Mask */
#define PWM_FPV2_FPZL2(value)                 (PWM_FPV2_FPZL2_Msk & (_UINT32_(value) << PWM_FPV2_FPZL2_Pos)) /* Assignment of value for FPZL2 in the PWM_FPV2 register */
#define PWM_FPV2_FPZL3_Pos                    _UINT32_(19)                                         /* (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 3 Position */
#define PWM_FPV2_FPZL3_Msk                    (_UINT32_(0x1) << PWM_FPV2_FPZL3_Pos)                /* (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 3 Mask */
#define PWM_FPV2_FPZL3(value)                 (PWM_FPV2_FPZL3_Msk & (_UINT32_(value) << PWM_FPV2_FPZL3_Pos)) /* Assignment of value for FPZL3 in the PWM_FPV2 register */
#define PWM_FPV2_Msk                          _UINT32_(0x000F000F)                                 /* (PWM_FPV2) Register Mask  */

#define PWM_FPV2_FPZH_Pos                     _UINT32_(0)                                          /* (PWM_FPV2 Position) Fault Protection to Hi-Z for PWMH output on channel x */
#define PWM_FPV2_FPZH_Msk                     (_UINT32_(0xF) << PWM_FPV2_FPZH_Pos)                 /* (PWM_FPV2 Mask) FPZH */
#define PWM_FPV2_FPZH(value)                  (PWM_FPV2_FPZH_Msk & (_UINT32_(value) << PWM_FPV2_FPZH_Pos)) 
#define PWM_FPV2_FPZL_Pos                     _UINT32_(16)                                         /* (PWM_FPV2 Position) Fault Protection to Hi-Z for PWML output on channel 3 */
#define PWM_FPV2_FPZL_Msk                     (_UINT32_(0xF) << PWM_FPV2_FPZL_Pos)                 /* (PWM_FPV2 Mask) FPZL */
#define PWM_FPV2_FPZL(value)                  (PWM_FPV2_FPZL_Msk & (_UINT32_(value) << PWM_FPV2_FPZL_Pos)) 

/* -------- PWM_WPCR : (PWM Offset: 0xE4) ( /W 32) PWM Write Protection Control Register -------- */
#define PWM_WPCR_WPCMD_Pos                    _UINT32_(0)                                          /* (PWM_WPCR) Write Protection Command Position */
#define PWM_WPCR_WPCMD_Msk                    (_UINT32_(0x3) << PWM_WPCR_WPCMD_Pos)                /* (PWM_WPCR) Write Protection Command Mask */
#define PWM_WPCR_WPCMD(value)                 (PWM_WPCR_WPCMD_Msk & (_UINT32_(value) << PWM_WPCR_WPCMD_Pos)) /* Assignment of value for WPCMD in the PWM_WPCR register */
#define   PWM_WPCR_WPCMD_DISABLE_SW_PROT_Val  _UINT32_(0x0)                                        /* (PWM_WPCR) Disables the software write protection of the register groups of which the bit WPRGx is at '1'.  */
#define   PWM_WPCR_WPCMD_ENABLE_SW_PROT_Val   _UINT32_(0x1)                                        /* (PWM_WPCR) Enables the software write protection of the register groups of which the bit WPRGx is at '1'.  */
#define   PWM_WPCR_WPCMD_ENABLE_HW_PROT_Val   _UINT32_(0x2)                                        /* (PWM_WPCR) Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface.  */
#define PWM_WPCR_WPCMD_DISABLE_SW_PROT        (PWM_WPCR_WPCMD_DISABLE_SW_PROT_Val << PWM_WPCR_WPCMD_Pos) /* (PWM_WPCR) Disables the software write protection of the register groups of which the bit WPRGx is at '1'. Position */
#define PWM_WPCR_WPCMD_ENABLE_SW_PROT         (PWM_WPCR_WPCMD_ENABLE_SW_PROT_Val << PWM_WPCR_WPCMD_Pos) /* (PWM_WPCR) Enables the software write protection of the register groups of which the bit WPRGx is at '1'. Position */
#define PWM_WPCR_WPCMD_ENABLE_HW_PROT         (PWM_WPCR_WPCMD_ENABLE_HW_PROT_Val << PWM_WPCR_WPCMD_Pos) /* (PWM_WPCR) Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface. Position */
#define PWM_WPCR_WPRG0_Pos                    _UINT32_(2)                                          /* (PWM_WPCR) Write Protection Register Group 0 Position */
#define PWM_WPCR_WPRG0_Msk                    (_UINT32_(0x1) << PWM_WPCR_WPRG0_Pos)                /* (PWM_WPCR) Write Protection Register Group 0 Mask */
#define PWM_WPCR_WPRG0(value)                 (PWM_WPCR_WPRG0_Msk & (_UINT32_(value) << PWM_WPCR_WPRG0_Pos)) /* Assignment of value for WPRG0 in the PWM_WPCR register */
#define PWM_WPCR_WPRG1_Pos                    _UINT32_(3)                                          /* (PWM_WPCR) Write Protection Register Group 1 Position */
#define PWM_WPCR_WPRG1_Msk                    (_UINT32_(0x1) << PWM_WPCR_WPRG1_Pos)                /* (PWM_WPCR) Write Protection Register Group 1 Mask */
#define PWM_WPCR_WPRG1(value)                 (PWM_WPCR_WPRG1_Msk & (_UINT32_(value) << PWM_WPCR_WPRG1_Pos)) /* Assignment of value for WPRG1 in the PWM_WPCR register */
#define PWM_WPCR_WPRG2_Pos                    _UINT32_(4)                                          /* (PWM_WPCR) Write Protection Register Group 2 Position */
#define PWM_WPCR_WPRG2_Msk                    (_UINT32_(0x1) << PWM_WPCR_WPRG2_Pos)                /* (PWM_WPCR) Write Protection Register Group 2 Mask */
#define PWM_WPCR_WPRG2(value)                 (PWM_WPCR_WPRG2_Msk & (_UINT32_(value) << PWM_WPCR_WPRG2_Pos)) /* Assignment of value for WPRG2 in the PWM_WPCR register */
#define PWM_WPCR_WPRG3_Pos                    _UINT32_(5)                                          /* (PWM_WPCR) Write Protection Register Group 3 Position */
#define PWM_WPCR_WPRG3_Msk                    (_UINT32_(0x1) << PWM_WPCR_WPRG3_Pos)                /* (PWM_WPCR) Write Protection Register Group 3 Mask */
#define PWM_WPCR_WPRG3(value)                 (PWM_WPCR_WPRG3_Msk & (_UINT32_(value) << PWM_WPCR_WPRG3_Pos)) /* Assignment of value for WPRG3 in the PWM_WPCR register */
#define PWM_WPCR_WPRG4_Pos                    _UINT32_(6)                                          /* (PWM_WPCR) Write Protection Register Group 4 Position */
#define PWM_WPCR_WPRG4_Msk                    (_UINT32_(0x1) << PWM_WPCR_WPRG4_Pos)                /* (PWM_WPCR) Write Protection Register Group 4 Mask */
#define PWM_WPCR_WPRG4(value)                 (PWM_WPCR_WPRG4_Msk & (_UINT32_(value) << PWM_WPCR_WPRG4_Pos)) /* Assignment of value for WPRG4 in the PWM_WPCR register */
#define PWM_WPCR_WPRG5_Pos                    _UINT32_(7)                                          /* (PWM_WPCR) Write Protection Register Group 5 Position */
#define PWM_WPCR_WPRG5_Msk                    (_UINT32_(0x1) << PWM_WPCR_WPRG5_Pos)                /* (PWM_WPCR) Write Protection Register Group 5 Mask */
#define PWM_WPCR_WPRG5(value)                 (PWM_WPCR_WPRG5_Msk & (_UINT32_(value) << PWM_WPCR_WPRG5_Pos)) /* Assignment of value for WPRG5 in the PWM_WPCR register */
#define PWM_WPCR_WPKEY_Pos                    _UINT32_(8)                                          /* (PWM_WPCR) Write Protection Key Position */
#define PWM_WPCR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << PWM_WPCR_WPKEY_Pos)           /* (PWM_WPCR) Write Protection Key Mask */
#define PWM_WPCR_WPKEY(value)                 (PWM_WPCR_WPKEY_Msk & (_UINT32_(value) << PWM_WPCR_WPKEY_Pos)) /* Assignment of value for WPKEY in the PWM_WPCR register */
#define   PWM_WPCR_WPKEY_PASSWD_Val           _UINT32_(0x50574D)                                   /* (PWM_WPCR) Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0  */
#define PWM_WPCR_WPKEY_PASSWD                 (PWM_WPCR_WPKEY_PASSWD_Val << PWM_WPCR_WPKEY_Pos)    /* (PWM_WPCR) Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0 Position */
#define PWM_WPCR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (PWM_WPCR) Register Mask  */

#define PWM_WPCR_WPRG_Pos                     _UINT32_(2)                                          /* (PWM_WPCR Position) Write Protection Register Group x */
#define PWM_WPCR_WPRG_Msk                     (_UINT32_(0x3F) << PWM_WPCR_WPRG_Pos)                /* (PWM_WPCR Mask) WPRG */
#define PWM_WPCR_WPRG(value)                  (PWM_WPCR_WPRG_Msk & (_UINT32_(value) << PWM_WPCR_WPRG_Pos)) 

/* -------- PWM_WPSR : (PWM Offset: 0xE8) ( R/ 32) PWM Write Protection Status Register -------- */
#define PWM_WPSR_WPSWS0_Pos                   _UINT32_(0)                                          /* (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS0_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPSWS0_Pos)               /* (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS0(value)                (PWM_WPSR_WPSWS0_Msk & (_UINT32_(value) << PWM_WPSR_WPSWS0_Pos)) /* Assignment of value for WPSWS0 in the PWM_WPSR register */
#define PWM_WPSR_WPSWS1_Pos                   _UINT32_(1)                                          /* (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS1_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPSWS1_Pos)               /* (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS1(value)                (PWM_WPSR_WPSWS1_Msk & (_UINT32_(value) << PWM_WPSR_WPSWS1_Pos)) /* Assignment of value for WPSWS1 in the PWM_WPSR register */
#define PWM_WPSR_WPSWS2_Pos                   _UINT32_(2)                                          /* (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS2_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPSWS2_Pos)               /* (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS2(value)                (PWM_WPSR_WPSWS2_Msk & (_UINT32_(value) << PWM_WPSR_WPSWS2_Pos)) /* Assignment of value for WPSWS2 in the PWM_WPSR register */
#define PWM_WPSR_WPSWS3_Pos                   _UINT32_(3)                                          /* (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS3_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPSWS3_Pos)               /* (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS3(value)                (PWM_WPSR_WPSWS3_Msk & (_UINT32_(value) << PWM_WPSR_WPSWS3_Pos)) /* Assignment of value for WPSWS3 in the PWM_WPSR register */
#define PWM_WPSR_WPSWS4_Pos                   _UINT32_(4)                                          /* (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS4_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPSWS4_Pos)               /* (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS4(value)                (PWM_WPSR_WPSWS4_Msk & (_UINT32_(value) << PWM_WPSR_WPSWS4_Pos)) /* Assignment of value for WPSWS4 in the PWM_WPSR register */
#define PWM_WPSR_WPSWS5_Pos                   _UINT32_(5)                                          /* (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS5_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPSWS5_Pos)               /* (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS5(value)                (PWM_WPSR_WPSWS5_Msk & (_UINT32_(value) << PWM_WPSR_WPSWS5_Pos)) /* Assignment of value for WPSWS5 in the PWM_WPSR register */
#define PWM_WPSR_WPVS_Pos                     _UINT32_(7)                                          /* (PWM_WPSR) Write Protect Violation Status Position */
#define PWM_WPSR_WPVS_Msk                     (_UINT32_(0x1) << PWM_WPSR_WPVS_Pos)                 /* (PWM_WPSR) Write Protect Violation Status Mask */
#define PWM_WPSR_WPVS(value)                  (PWM_WPSR_WPVS_Msk & (_UINT32_(value) << PWM_WPSR_WPVS_Pos)) /* Assignment of value for WPVS in the PWM_WPSR register */
#define PWM_WPSR_WPHWS0_Pos                   _UINT32_(8)                                          /* (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS0_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPHWS0_Pos)               /* (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS0(value)                (PWM_WPSR_WPHWS0_Msk & (_UINT32_(value) << PWM_WPSR_WPHWS0_Pos)) /* Assignment of value for WPHWS0 in the PWM_WPSR register */
#define PWM_WPSR_WPHWS1_Pos                   _UINT32_(9)                                          /* (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS1_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPHWS1_Pos)               /* (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS1(value)                (PWM_WPSR_WPHWS1_Msk & (_UINT32_(value) << PWM_WPSR_WPHWS1_Pos)) /* Assignment of value for WPHWS1 in the PWM_WPSR register */
#define PWM_WPSR_WPHWS2_Pos                   _UINT32_(10)                                         /* (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS2_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPHWS2_Pos)               /* (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS2(value)                (PWM_WPSR_WPHWS2_Msk & (_UINT32_(value) << PWM_WPSR_WPHWS2_Pos)) /* Assignment of value for WPHWS2 in the PWM_WPSR register */
#define PWM_WPSR_WPHWS3_Pos                   _UINT32_(11)                                         /* (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS3_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPHWS3_Pos)               /* (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS3(value)                (PWM_WPSR_WPHWS3_Msk & (_UINT32_(value) << PWM_WPSR_WPHWS3_Pos)) /* Assignment of value for WPHWS3 in the PWM_WPSR register */
#define PWM_WPSR_WPHWS4_Pos                   _UINT32_(12)                                         /* (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS4_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPHWS4_Pos)               /* (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS4(value)                (PWM_WPSR_WPHWS4_Msk & (_UINT32_(value) << PWM_WPSR_WPHWS4_Pos)) /* Assignment of value for WPHWS4 in the PWM_WPSR register */
#define PWM_WPSR_WPHWS5_Pos                   _UINT32_(13)                                         /* (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS5_Msk                   (_UINT32_(0x1) << PWM_WPSR_WPHWS5_Pos)               /* (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS5(value)                (PWM_WPSR_WPHWS5_Msk & (_UINT32_(value) << PWM_WPSR_WPHWS5_Pos)) /* Assignment of value for WPHWS5 in the PWM_WPSR register */
#define PWM_WPSR_WPVSRC_Pos                   _UINT32_(16)                                         /* (PWM_WPSR) Write Protect Violation Source Position */
#define PWM_WPSR_WPVSRC_Msk                   (_UINT32_(0xFFFF) << PWM_WPSR_WPVSRC_Pos)            /* (PWM_WPSR) Write Protect Violation Source Mask */
#define PWM_WPSR_WPVSRC(value)                (PWM_WPSR_WPVSRC_Msk & (_UINT32_(value) << PWM_WPSR_WPVSRC_Pos)) /* Assignment of value for WPVSRC in the PWM_WPSR register */
#define PWM_WPSR_Msk                          _UINT32_(0xFFFF3FBF)                                 /* (PWM_WPSR) Register Mask  */

#define PWM_WPSR_WPSWS_Pos                    _UINT32_(0)                                          /* (PWM_WPSR Position) Write Protect SW Status */
#define PWM_WPSR_WPSWS_Msk                    (_UINT32_(0x3F) << PWM_WPSR_WPSWS_Pos)               /* (PWM_WPSR Mask) WPSWS */
#define PWM_WPSR_WPSWS(value)                 (PWM_WPSR_WPSWS_Msk & (_UINT32_(value) << PWM_WPSR_WPSWS_Pos)) 
#define PWM_WPSR_WPHWS_Pos                    _UINT32_(8)                                          /* (PWM_WPSR Position) Write Protect HW Status */
#define PWM_WPSR_WPHWS_Msk                    (_UINT32_(0x3F) << PWM_WPSR_WPHWS_Pos)               /* (PWM_WPSR Mask) WPHWS */
#define PWM_WPSR_WPHWS(value)                 (PWM_WPSR_WPHWS_Msk & (_UINT32_(value) << PWM_WPSR_WPHWS_Pos)) 

