MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamv71q21rt/thirdparty/atsamv71q21rt/component/pwm.h
/* -------- PWM_CMUPD0 : (PWM Offset: 0x400) ( /W 32) PWM Channel Mode Up2025-05-27 Register (ch_num = 0) -------- */
#define PWM_CMUPD0_CPOLUP_Pos                 _UINT32_(9)                                          /* (PWM_CMUPD0) Channel Polarity Up2025-05-27 Position */
#define PWM_CMUPD0_CPOLUP_Msk                 (_UINT32_(0x1) << PWM_CMUPD0_CPOLUP_Pos)             /* (PWM_CMUPD0) Channel Polarity Up2025-05-27 Mask */
#define PWM_CMUPD0_CPOLUP(value)              (PWM_CMUPD0_CPOLUP_Msk & (_UINT32_(value) << PWM_CMUPD0_CPOLUP_Pos)) /* Assignment of value for CPOLUP in the PWM_CMUPD0 register */
#define PWM_CMUPD0_CPOLINVUP_Pos              _UINT32_(13)                                         /* (PWM_CMUPD0) Channel Polarity Inversion Up2025-05-27 Position */
#define PWM_CMUPD0_CPOLINVUP_Msk              (_UINT32_(0x1) << PWM_CMUPD0_CPOLINVUP_Pos)          /* (PWM_CMUPD0) Channel Polarity Inversion Up2025-05-27 Mask */
#define PWM_CMUPD0_CPOLINVUP(value)           (PWM_CMUPD0_CPOLINVUP_Msk & (_UINT32_(value) << PWM_CMUPD0_CPOLINVUP_Pos)) /* Assignment of value for CPOLINVUP in the PWM_CMUPD0 register */
#define PWM_CMUPD0_Msk                        _UINT32_(0x00002200)                                 /* (PWM_CMUPD0) Register Mask  */


/* -------- PWM_CMUPD1 : (PWM Offset: 0x420) ( /W 32) PWM Channel Mode Up2025-05-27 Register (ch_num = 1) -------- */
#define PWM_CMUPD1_CPOLUP_Pos                 _UINT32_(9)                                          /* (PWM_CMUPD1) Channel Polarity Up2025-05-27 Position */
#define PWM_CMUPD1_CPOLUP_Msk                 (_UINT32_(0x1) << PWM_CMUPD1_CPOLUP_Pos)             /* (PWM_CMUPD1) Channel Polarity Up2025-05-27 Mask */
#define PWM_CMUPD1_CPOLUP(value)              (PWM_CMUPD1_CPOLUP_Msk & (_UINT32_(value) << PWM_CMUPD1_CPOLUP_Pos)) /* Assignment of value for CPOLUP in the PWM_CMUPD1 register */
#define PWM_CMUPD1_CPOLINVUP_Pos              _UINT32_(13)                                         /* (PWM_CMUPD1) Channel Polarity Inversion Up2025-05-27 Position */
#define PWM_CMUPD1_CPOLINVUP_Msk              (_UINT32_(0x1) << PWM_CMUPD1_CPOLINVUP_Pos)          /* (PWM_CMUPD1) Channel Polarity Inversion Up2025-05-27 Mask */
#define PWM_CMUPD1_CPOLINVUP(value)           (PWM_CMUPD1_CPOLINVUP_Msk & (_UINT32_(value) << PWM_CMUPD1_CPOLINVUP_Pos)) /* Assignment of value for CPOLINVUP in the PWM_CMUPD1 register */
#define PWM_CMUPD1_Msk                        _UINT32_(0x00002200)                                 /* (PWM_CMUPD1) Register Mask  */


/* -------- PWM_ETRG1 : (PWM Offset: 0x42C) (R/W 32) PWM External Trigger Register (trg_num = 1) -------- */
#define PWM_ETRG1_MAXCNT_Pos                  _UINT32_(0)                                          /* (PWM_ETRG1) Maximum Counter value Position */
#define PWM_ETRG1_MAXCNT_Msk                  (_UINT32_(0xFFFFFF) << PWM_ETRG1_MAXCNT_Pos)         /* (PWM_ETRG1) Maximum Counter value Mask */
#define PWM_ETRG1_MAXCNT(value)               (PWM_ETRG1_MAXCNT_Msk & (_UINT32_(value) << PWM_ETRG1_MAXCNT_Pos)) /* Assignment of value for MAXCNT in the PWM_ETRG1 register */
#define PWM_ETRG1_TRGMODE_Pos                 _UINT32_(24)                                         /* (PWM_ETRG1) External Trigger Mode Position */
#define PWM_ETRG1_TRGMODE_Msk                 (_UINT32_(0x3) << PWM_ETRG1_TRGMODE_Pos)             /* (PWM_ETRG1) External Trigger Mode Mask */
#define PWM_ETRG1_TRGMODE(value)              (PWM_ETRG1_TRGMODE_Msk & (_UINT32_(value) << PWM_ETRG1_TRGMODE_Pos)) /* Assignment of value for TRGMODE in the PWM_ETRG1 register */
#define   PWM_ETRG1_TRGMODE_OFF_Val           _UINT32_(0x0)                                        /* (PWM_ETRG1) External trigger is not enabled.  */
#define   PWM_ETRG1_TRGMODE_MODE1_Val         _UINT32_(0x1)                                        /* (PWM_ETRG1) External PWM Reset Mode  */
#define   PWM_ETRG1_TRGMODE_MODE2_Val         _UINT32_(0x2)                                        /* (PWM_ETRG1) External PWM Start Mode  */
#define   PWM_ETRG1_TRGMODE_MODE3_Val         _UINT32_(0x3)                                        /* (PWM_ETRG1) Cycle-by-cycle Duty Mode  */
#define PWM_ETRG1_TRGMODE_OFF                 (PWM_ETRG1_TRGMODE_OFF_Val << PWM_ETRG1_TRGMODE_Pos) /* (PWM_ETRG1) External trigger is not enabled. Position */
#define PWM_ETRG1_TRGMODE_MODE1               (PWM_ETRG1_TRGMODE_MODE1_Val << PWM_ETRG1_TRGMODE_Pos) /* (PWM_ETRG1) External PWM Reset Mode Position */
#define PWM_ETRG1_TRGMODE_MODE2               (PWM_ETRG1_TRGMODE_MODE2_Val << PWM_ETRG1_TRGMODE_Pos) /* (PWM_ETRG1) External PWM Start Mode Position */
#define PWM_ETRG1_TRGMODE_MODE3               (PWM_ETRG1_TRGMODE_MODE3_Val << PWM_ETRG1_TRGMODE_Pos) /* (PWM_ETRG1) Cycle-by-cycle Duty Mode Position */
#define PWM_ETRG1_TRGEDGE_Pos                 _UINT32_(28)                                         /* (PWM_ETRG1) Edge Selection Position */
#define PWM_ETRG1_TRGEDGE_Msk                 (_UINT32_(0x1) << PWM_ETRG1_TRGEDGE_Pos)             /* (PWM_ETRG1) Edge Selection Mask */
#define PWM_ETRG1_TRGEDGE(value)              (PWM_ETRG1_TRGEDGE_Msk & (_UINT32_(value) << PWM_ETRG1_TRGEDGE_Pos)) /* Assignment of value for TRGEDGE in the PWM_ETRG1 register */
#define   PWM_ETRG1_TRGEDGE_FALLING_ZERO_Val  _UINT32_(0x0)                                        /* (PWM_ETRG1) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0  */
#define   PWM_ETRG1_TRGEDGE_RISING_ONE_Val    _UINT32_(0x1)                                        /* (PWM_ETRG1) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1  */
#define PWM_ETRG1_TRGEDGE_FALLING_ZERO        (PWM_ETRG1_TRGEDGE_FALLING_ZERO_Val << PWM_ETRG1_TRGEDGE_Pos) /* (PWM_ETRG1) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0 Position */
#define PWM_ETRG1_TRGEDGE_RISING_ONE          (PWM_ETRG1_TRGEDGE_RISING_ONE_Val << PWM_ETRG1_TRGEDGE_Pos) /* (PWM_ETRG1) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1 Position */
#define PWM_ETRG1_TRGFILT_Pos                 _UINT32_(29)                                         /* (PWM_ETRG1) Filtered input Position */
#define PWM_ETRG1_TRGFILT_Msk                 (_UINT32_(0x1) << PWM_ETRG1_TRGFILT_Pos)             /* (PWM_ETRG1) Filtered input Mask */
#define PWM_ETRG1_TRGFILT(value)              (PWM_ETRG1_TRGFILT_Msk & (_UINT32_(value) << PWM_ETRG1_TRGFILT_Pos)) /* Assignment of value for TRGFILT in the PWM_ETRG1 register */
#define PWM_ETRG1_TRGSRC_Pos                  _UINT32_(30)                                         /* (PWM_ETRG1) Trigger Source Position */
#define PWM_ETRG1_TRGSRC_Msk                  (_UINT32_(0x1) << PWM_ETRG1_TRGSRC_Pos)              /* (PWM_ETRG1) Trigger Source Mask */
#define PWM_ETRG1_TRGSRC(value)               (PWM_ETRG1_TRGSRC_Msk & (_UINT32_(value) << PWM_ETRG1_TRGSRC_Pos)) /* Assignment of value for TRGSRC in the PWM_ETRG1 register */
#define PWM_ETRG1_RFEN_Pos                    _UINT32_(31)                                         /* (PWM_ETRG1) Recoverable Fault Enable Position */
#define PWM_ETRG1_RFEN_Msk                    (_UINT32_(0x1) << PWM_ETRG1_RFEN_Pos)                /* (PWM_ETRG1) Recoverable Fault Enable Mask */
#define PWM_ETRG1_RFEN(value)                 (PWM_ETRG1_RFEN_Msk & (_UINT32_(value) << PWM_ETRG1_RFEN_Pos)) /* Assignment of value for RFEN in the PWM_ETRG1 register */
#define PWM_ETRG1_Msk                         _UINT32_(0xF3FFFFFF)                                 /* (PWM_ETRG1) Register Mask  */


/* -------- PWM_LEBR1 : (PWM Offset: 0x430) (R/W 32) PWM Leading-Edge Blanking Register (trg_num = 1) -------- */
#define PWM_LEBR1_LEBDELAY_Pos                _UINT32_(0)                                          /* (PWM_LEBR1) Leading-Edge Blanking Delay for TRGINx Position */
#define PWM_LEBR1_LEBDELAY_Msk                (_UINT32_(0x7F) << PWM_LEBR1_LEBDELAY_Pos)           /* (PWM_LEBR1) Leading-Edge Blanking Delay for TRGINx Mask */
#define PWM_LEBR1_LEBDELAY(value)             (PWM_LEBR1_LEBDELAY_Msk & (_UINT32_(value) << PWM_LEBR1_LEBDELAY_Pos)) /* Assignment of value for LEBDELAY in the PWM_LEBR1 register */
#define PWM_LEBR1_PWMLFEN_Pos                 _UINT32_(16)                                         /* (PWM_LEBR1) PWML Falling Edge Enable Position */
#define PWM_LEBR1_PWMLFEN_Msk                 (_UINT32_(0x1) << PWM_LEBR1_PWMLFEN_Pos)             /* (PWM_LEBR1) PWML Falling Edge Enable Mask */
#define PWM_LEBR1_PWMLFEN(value)              (PWM_LEBR1_PWMLFEN_Msk & (_UINT32_(value) << PWM_LEBR1_PWMLFEN_Pos)) /* Assignment of value for PWMLFEN in the PWM_LEBR1 register */
#define PWM_LEBR1_PWMLREN_Pos                 _UINT32_(17)                                         /* (PWM_LEBR1) PWML Rising Edge Enable Position */
#define PWM_LEBR1_PWMLREN_Msk                 (_UINT32_(0x1) << PWM_LEBR1_PWMLREN_Pos)             /* (PWM_LEBR1) PWML Rising Edge Enable Mask */
#define PWM_LEBR1_PWMLREN(value)              (PWM_LEBR1_PWMLREN_Msk & (_UINT32_(value) << PWM_LEBR1_PWMLREN_Pos)) /* Assignment of value for PWMLREN in the PWM_LEBR1 register */
#define PWM_LEBR1_PWMHFEN_Pos                 _UINT32_(18)                                         /* (PWM_LEBR1) PWMH Falling Edge Enable Position */
#define PWM_LEBR1_PWMHFEN_Msk                 (_UINT32_(0x1) << PWM_LEBR1_PWMHFEN_Pos)             /* (PWM_LEBR1) PWMH Falling Edge Enable Mask */
#define PWM_LEBR1_PWMHFEN(value)              (PWM_LEBR1_PWMHFEN_Msk & (_UINT32_(value) << PWM_LEBR1_PWMHFEN_Pos)) /* Assignment of value for PWMHFEN in the PWM_LEBR1 register */
#define PWM_LEBR1_PWMHREN_Pos                 _UINT32_(19)                                         /* (PWM_LEBR1) PWMH Rising Edge Enable Position */
#define PWM_LEBR1_PWMHREN_Msk                 (_UINT32_(0x1) << PWM_LEBR1_PWMHREN_Pos)             /* (PWM_LEBR1) PWMH Rising Edge Enable Mask */
#define PWM_LEBR1_PWMHREN(value)              (PWM_LEBR1_PWMHREN_Msk & (_UINT32_(value) << PWM_LEBR1_PWMHREN_Pos)) /* Assignment of value for PWMHREN in the PWM_LEBR1 register */
#define PWM_LEBR1_Msk                         _UINT32_(0x000F007F)                                 /* (PWM_LEBR1) Register Mask  */


/* -------- PWM_CMUPD2 : (PWM Offset: 0x440) ( /W 32) PWM Channel Mode Up2025-05-27 Register (ch_num = 2) -------- */
#define PWM_CMUPD2_CPOLUP_Pos                 _UINT32_(9)                                          /* (PWM_CMUPD2) Channel Polarity Up2025-05-27 Position */
#define PWM_CMUPD2_CPOLUP_Msk                 (_UINT32_(0x1) << PWM_CMUPD2_CPOLUP_Pos)             /* (PWM_CMUPD2) Channel Polarity Up2025-05-27 Mask */
#define PWM_CMUPD2_CPOLUP(value)              (PWM_CMUPD2_CPOLUP_Msk & (_UINT32_(value) << PWM_CMUPD2_CPOLUP_Pos)) /* Assignment of value for CPOLUP in the PWM_CMUPD2 register */
#define PWM_CMUPD2_CPOLINVUP_Pos              _UINT32_(13)                                         /* (PWM_CMUPD2) Channel Polarity Inversion Up2025-05-27 Position */
#define PWM_CMUPD2_CPOLINVUP_Msk              (_UINT32_(0x1) << PWM_CMUPD2_CPOLINVUP_Pos)          /* (PWM_CMUPD2) Channel Polarity Inversion Up2025-05-27 Mask */
#define PWM_CMUPD2_CPOLINVUP(value)           (PWM_CMUPD2_CPOLINVUP_Msk & (_UINT32_(value) << PWM_CMUPD2_CPOLINVUP_Pos)) /* Assignment of value for CPOLINVUP in the PWM_CMUPD2 register */
#define PWM_CMUPD2_Msk                        _UINT32_(0x00002200)                                 /* (PWM_CMUPD2) Register Mask  */


/* -------- PWM_ETRG2 : (PWM Offset: 0x44C) (R/W 32) PWM External Trigger Register (trg_num = 2) -------- */
#define PWM_ETRG2_MAXCNT_Pos                  _UINT32_(0)                                          /* (PWM_ETRG2) Maximum Counter value Position */
#define PWM_ETRG2_MAXCNT_Msk                  (_UINT32_(0xFFFFFF) << PWM_ETRG2_MAXCNT_Pos)         /* (PWM_ETRG2) Maximum Counter value Mask */
#define PWM_ETRG2_MAXCNT(value)               (PWM_ETRG2_MAXCNT_Msk & (_UINT32_(value) << PWM_ETRG2_MAXCNT_Pos)) /* Assignment of value for MAXCNT in the PWM_ETRG2 register */
#define PWM_ETRG2_TRGMODE_Pos                 _UINT32_(24)                                         /* (PWM_ETRG2) External Trigger Mode Position */
#define PWM_ETRG2_TRGMODE_Msk                 (_UINT32_(0x3) << PWM_ETRG2_TRGMODE_Pos)             /* (PWM_ETRG2) External Trigger Mode Mask */
#define PWM_ETRG2_TRGMODE(value)              (PWM_ETRG2_TRGMODE_Msk & (_UINT32_(value) << PWM_ETRG2_TRGMODE_Pos)) /* Assignment of value for TRGMODE in the PWM_ETRG2 register */
#define   PWM_ETRG2_TRGMODE_OFF_Val           _UINT32_(0x0)                                        /* (PWM_ETRG2) External trigger is not enabled.  */
#define   PWM_ETRG2_TRGMODE_MODE1_Val         _UINT32_(0x1)                                        /* (PWM_ETRG2) External PWM Reset Mode  */
#define   PWM_ETRG2_TRGMODE_MODE2_Val         _UINT32_(0x2)                                        /* (PWM_ETRG2) External PWM Start Mode  */
#define   PWM_ETRG2_TRGMODE_MODE3_Val         _UINT32_(0x3)                                        /* (PWM_ETRG2) Cycle-by-cycle Duty Mode  */
#define PWM_ETRG2_TRGMODE_OFF                 (PWM_ETRG2_TRGMODE_OFF_Val << PWM_ETRG2_TRGMODE_Pos) /* (PWM_ETRG2) External trigger is not enabled. Position */
#define PWM_ETRG2_TRGMODE_MODE1               (PWM_ETRG2_TRGMODE_MODE1_Val << PWM_ETRG2_TRGMODE_Pos) /* (PWM_ETRG2) External PWM Reset Mode Position */
#define PWM_ETRG2_TRGMODE_MODE2               (PWM_ETRG2_TRGMODE_MODE2_Val << PWM_ETRG2_TRGMODE_Pos) /* (PWM_ETRG2) External PWM Start Mode Position */
#define PWM_ETRG2_TRGMODE_MODE3               (PWM_ETRG2_TRGMODE_MODE3_Val << PWM_ETRG2_TRGMODE_Pos) /* (PWM_ETRG2) Cycle-by-cycle Duty Mode Position */
#define PWM_ETRG2_TRGEDGE_Pos                 _UINT32_(28)                                         /* (PWM_ETRG2) Edge Selection Position */
#define PWM_ETRG2_TRGEDGE_Msk                 (_UINT32_(0x1) << PWM_ETRG2_TRGEDGE_Pos)             /* (PWM_ETRG2) Edge Selection Mask */
#define PWM_ETRG2_TRGEDGE(value)              (PWM_ETRG2_TRGEDGE_Msk & (_UINT32_(value) << PWM_ETRG2_TRGEDGE_Pos)) /* Assignment of value for TRGEDGE in the PWM_ETRG2 register */
#define   PWM_ETRG2_TRGEDGE_FALLING_ZERO_Val  _UINT32_(0x0)                                        /* (PWM_ETRG2) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0  */
#define   PWM_ETRG2_TRGEDGE_RISING_ONE_Val    _UINT32_(0x1)                                        /* (PWM_ETRG2) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1  */
#define PWM_ETRG2_TRGEDGE_FALLING_ZERO        (PWM_ETRG2_TRGEDGE_FALLING_ZERO_Val << PWM_ETRG2_TRGEDGE_Pos) /* (PWM_ETRG2) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0 Position */
#define PWM_ETRG2_TRGEDGE_RISING_ONE          (PWM_ETRG2_TRGEDGE_RISING_ONE_Val << PWM_ETRG2_TRGEDGE_Pos) /* (PWM_ETRG2) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1 Position */
#define PWM_ETRG2_TRGFILT_Pos                 _UINT32_(29)                                         /* (PWM_ETRG2) Filtered input Position */
#define PWM_ETRG2_TRGFILT_Msk                 (_UINT32_(0x1) << PWM_ETRG2_TRGFILT_Pos)             /* (PWM_ETRG2) Filtered input Mask */
#define PWM_ETRG2_TRGFILT(value)              (PWM_ETRG2_TRGFILT_Msk & (_UINT32_(value) << PWM_ETRG2_TRGFILT_Pos)) /* Assignment of value for TRGFILT in the PWM_ETRG2 register */
#define PWM_ETRG2_TRGSRC_Pos                  _UINT32_(30)                                         /* (PWM_ETRG2) Trigger Source Position */
#define PWM_ETRG2_TRGSRC_Msk                  (_UINT32_(0x1) << PWM_ETRG2_TRGSRC_Pos)              /* (PWM_ETRG2) Trigger Source Mask */
#define PWM_ETRG2_TRGSRC(value)               (PWM_ETRG2_TRGSRC_Msk & (_UINT32_(value) << PWM_ETRG2_TRGSRC_Pos)) /* Assignment of value for TRGSRC in the PWM_ETRG2 register */
#define PWM_ETRG2_RFEN_Pos                    _UINT32_(31)                                         /* (PWM_ETRG2) Recoverable Fault Enable Position */
#define PWM_ETRG2_RFEN_Msk                    (_UINT32_(0x1) << PWM_ETRG2_RFEN_Pos)                /* (PWM_ETRG2) Recoverable Fault Enable Mask */
#define PWM_ETRG2_RFEN(value)                 (PWM_ETRG2_RFEN_Msk & (_UINT32_(value) << PWM_ETRG2_RFEN_Pos)) /* Assignment of value for RFEN in the PWM_ETRG2 register */
#define PWM_ETRG2_Msk                         _UINT32_(0xF3FFFFFF)                                 /* (PWM_ETRG2) Register Mask  */


/* -------- PWM_LEBR2 : (PWM Offset: 0x450) (R/W 32) PWM Leading-Edge Blanking Register (trg_num = 2) -------- */
#define PWM_LEBR2_LEBDELAY_Pos                _UINT32_(0)                                          /* (PWM_LEBR2) Leading-Edge Blanking Delay for TRGINx Position */
#define PWM_LEBR2_LEBDELAY_Msk                (_UINT32_(0x7F) << PWM_LEBR2_LEBDELAY_Pos)           /* (PWM_LEBR2) Leading-Edge Blanking Delay for TRGINx Mask */
#define PWM_LEBR2_LEBDELAY(value)             (PWM_LEBR2_LEBDELAY_Msk & (_UINT32_(value) << PWM_LEBR2_LEBDELAY_Pos)) /* Assignment of value for LEBDELAY in the PWM_LEBR2 register */
#define PWM_LEBR2_PWMLFEN_Pos                 _UINT32_(16)                                         /* (PWM_LEBR2) PWML Falling Edge Enable Position */
#define PWM_LEBR2_PWMLFEN_Msk                 (_UINT32_(0x1) << PWM_LEBR2_PWMLFEN_Pos)             /* (PWM_LEBR2) PWML Falling Edge Enable Mask */
#define PWM_LEBR2_PWMLFEN(value)              (PWM_LEBR2_PWMLFEN_Msk & (_UINT32_(value) << PWM_LEBR2_PWMLFEN_Pos)) /* Assignment of value for PWMLFEN in the PWM_LEBR2 register */
#define PWM_LEBR2_PWMLREN_Pos                 _UINT32_(17)                                         /* (PWM_LEBR2) PWML Rising Edge Enable Position */
#define PWM_LEBR2_PWMLREN_Msk                 (_UINT32_(0x1) << PWM_LEBR2_PWMLREN_Pos)             /* (PWM_LEBR2) PWML Rising Edge Enable Mask */
#define PWM_LEBR2_PWMLREN(value)              (PWM_LEBR2_PWMLREN_Msk & (_UINT32_(value) << PWM_LEBR2_PWMLREN_Pos)) /* Assignment of value for PWMLREN in the PWM_LEBR2 register */
#define PWM_LEBR2_PWMHFEN_Pos                 _UINT32_(18)                                         /* (PWM_LEBR2) PWMH Falling Edge Enable Position */
#define PWM_LEBR2_PWMHFEN_Msk                 (_UINT32_(0x1) << PWM_LEBR2_PWMHFEN_Pos)             /* (PWM_LEBR2) PWMH Falling Edge Enable Mask */
#define PWM_LEBR2_PWMHFEN(value)              (PWM_LEBR2_PWMHFEN_Msk & (_UINT32_(value) << PWM_LEBR2_PWMHFEN_Pos)) /* Assignment of value for PWMHFEN in the PWM_LEBR2 register */
#define PWM_LEBR2_PWMHREN_Pos                 _UINT32_(19)                                         /* (PWM_LEBR2) PWMH Rising Edge Enable Position */
#define PWM_LEBR2_PWMHREN_Msk                 (_UINT32_(0x1) << PWM_LEBR2_PWMHREN_Pos)             /* (PWM_LEBR2) PWMH Rising Edge Enable Mask */
#define PWM_LEBR2_PWMHREN(value)              (PWM_LEBR2_PWMHREN_Msk & (_UINT32_(value) << PWM_LEBR2_PWMHREN_Pos)) /* Assignment of value for PWMHREN in the PWM_LEBR2 register */
#define PWM_LEBR2_Msk                         _UINT32_(0x000F007F)                                 /* (PWM_LEBR2) Register Mask  */


/* -------- PWM_CMUPD3 : (PWM Offset: 0x460) ( /W 32) PWM Channel Mode Up2025-05-27 Register (ch_num = 3) -------- */
#define PWM_CMUPD3_CPOLUP_Pos                 _UINT32_(9)                                          /* (PWM_CMUPD3) Channel Polarity Up2025-05-27 Position */
#define PWM_CMUPD3_CPOLUP_Msk                 (_UINT32_(0x1) << PWM_CMUPD3_CPOLUP_Pos)             /* (PWM_CMUPD3) Channel Polarity Up2025-05-27 Mask */
#define PWM_CMUPD3_CPOLUP(value)              (PWM_CMUPD3_CPOLUP_Msk & (_UINT32_(value) << PWM_CMUPD3_CPOLUP_Pos)) /* Assignment of value for CPOLUP in the PWM_CMUPD3 register */
#define PWM_CMUPD3_CPOLINVUP_Pos              _UINT32_(13)                                         /* (PWM_CMUPD3) Channel Polarity Inversion Up2025-05-27 Position */
#define PWM_CMUPD3_CPOLINVUP_Msk              (_UINT32_(0x1) << PWM_CMUPD3_CPOLINVUP_Pos)          /* (PWM_CMUPD3) Channel Polarity Inversion Up2025-05-27 Mask */
#define PWM_CMUPD3_CPOLINVUP(value)           (PWM_CMUPD3_CPOLINVUP_Msk & (_UINT32_(value) << PWM_CMUPD3_CPOLINVUP_Pos)) /* Assignment of value for CPOLINVUP in the PWM_CMUPD3 register */
#define PWM_CMUPD3_Msk                        _UINT32_(0x00002200)                                 /* (PWM_CMUPD3) Register Mask  */


