MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamv71q21rt/thirdparty/atsamv71q21rt/component/pwm.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* PWM_CH_NUM register API structure */
typedef struct
{
  __IO  uint32_t                       PWM_CMR;            /* Offset: 0x00 (R/W  32) PWM Channel Mode Register */
  __IO  uint32_t                       PWM_CDTY;           /* Offset: 0x04 (R/W  32) PWM Channel Duty Cycle Register */
  __O   uint32_t                       PWM_CDTYUPD;        /* Offset: 0x08 ( /W  32) PWM Channel Duty Cycle Up2025-05-27 Register */
  __IO  uint32_t                       PWM_CPRD;           /* Offset: 0x0C (R/W  32) PWM Channel Period Register */
  __O   uint32_t                       PWM_CPRDUPD;        /* Offset: 0x10 ( /W  32) PWM Channel Period Up2025-05-27 Register */
  __I   uint32_t                       PWM_CCNT;           /* Offset: 0x14 (R/   32) PWM Channel Counter Register */
  __IO  uint32_t                       PWM_DT;             /* Offset: 0x18 (R/W  32) PWM Channel Dead Time Register */
  __O   uint32_t                       PWM_DTUPD;          /* Offset: 0x1C ( /W  32) PWM Channel Dead Time Up2025-05-27 Register */
} pwm_ch_num_registers_t;

/* PWM_CMP register API structure */
typedef struct
{
  __IO  uint32_t                       PWM_CMPV;           /* Offset: 0x00 (R/W  32) PWM Comparison 0 Value Register */
  __O   uint32_t                       PWM_CMPVUPD;        /* Offset: 0x04 ( /W  32) PWM Comparison 0 Value Up2025-05-27 Register */
  __IO  uint32_t                       PWM_CMPM;           /* Offset: 0x08 (R/W  32) PWM Comparison 0 Mode Register */
  __O   uint32_t                       PWM_CMPMUPD;        /* Offset: 0x0C ( /W  32) PWM Comparison 0 Mode Up2025-05-27 Register */
} pwm_cmp_registers_t;

#define PWM_CMP_NUMBER 8

#define PWM_CH_NUM_NUMBER 4

/* PWM register API structure */
typedef struct
{
  __IO  uint32_t                       PWM_CLK;            /* Offset: 0x00 (R/W  32) PWM Clock Register */
  __O   uint32_t                       PWM_ENA;            /* Offset: 0x04 ( /W  32) PWM Enable Register */
  __O   uint32_t                       PWM_DIS;            /* Offset: 0x08 ( /W  32) PWM Disable Register */
  __I   uint32_t                       PWM_SR;             /* Offset: 0x0C (R/   32) PWM Status Register */
  __O   uint32_t                       PWM_IER1;           /* Offset: 0x10 ( /W  32) PWM Interrupt Enable Register 1 */
  __O   uint32_t                       PWM_IDR1;           /* Offset: 0x14 ( /W  32) PWM Interrupt Disable Register 1 */
  __I   uint32_t                       PWM_IMR1;           /* Offset: 0x18 (R/   32) PWM Interrupt Mask Register 1 */
  __I   uint32_t                       PWM_ISR1;           /* Offset: 0x1C (R/   32) PWM Interrupt Status Register 1 */
  __IO  uint32_t                       PWM_SCM;            /* Offset: 0x20 (R/W  32) PWM Sync Channels Mode Register */
  __O   uint32_t                       PWM_DMAR;           /* Offset: 0x24 ( /W  32) PWM DMA Register */
  __IO  uint32_t                       PWM_SCUC;           /* Offset: 0x28 (R/W  32) PWM Sync Channels Up2025-05-27 Control Register */
  __IO  uint32_t                       PWM_SCUP;           /* Offset: 0x2C (R/W  32) PWM Sync Channels Up2025-05-27 Period Register */
  __O   uint32_t                       PWM_SCUPUPD;        /* Offset: 0x30 ( /W  32) PWM Sync Channels Up2025-05-27 Period Up2025-05-27 Register */
  __O   uint32_t                       PWM_IER2;           /* Offset: 0x34 ( /W  32) PWM Interrupt Enable Register 2 */
  __O   uint32_t                       PWM_IDR2;           /* Offset: 0x38 ( /W  32) PWM Interrupt Disable Register 2 */
  __I   uint32_t                       PWM_IMR2;           /* Offset: 0x3C (R/   32) PWM Interrupt Mask Register 2 */
  __I   uint32_t                       PWM_ISR2;           /* Offset: 0x40 (R/   32) PWM Interrupt Status Register 2 */
  __IO  uint32_t                       PWM_OOV;            /* Offset: 0x44 (R/W  32) PWM Output Override Value Register */
  __IO  uint32_t                       PWM_OS;             /* Offset: 0x48 (R/W  32) PWM Output Selection Register */
  __O   uint32_t                       PWM_OSS;            /* Offset: 0x4C ( /W  32) PWM Output Selection Set Register */
  __O   uint32_t                       PWM_OSC;            /* Offset: 0x50 ( /W  32) PWM Output Selection Clear Register */
  __O   uint32_t                       PWM_OSSUPD;         /* Offset: 0x54 ( /W  32) PWM Output Selection Set Up2025-05-27 Register */
  __O   uint32_t                       PWM_OSCUPD;         /* Offset: 0x58 ( /W  32) PWM Output Selection Clear Up2025-05-27 Register */
  __IO  uint32_t                       PWM_FMR;            /* Offset: 0x5C (R/W  32) PWM Fault Mode Register */
  __I   uint32_t                       PWM_FSR;            /* Offset: 0x60 (R/   32) PWM Fault Status Register */
  __O   uint32_t                       PWM_FCR;            /* Offset: 0x64 ( /W  32) PWM Fault Clear Register */
  __IO  uint32_t                       PWM_FPV1;           /* Offset: 0x68 (R/W  32) PWM Fault Protection Value Register 1 */
  __IO  uint32_t                       PWM_FPE;            /* Offset: 0x6C (R/W  32) PWM Fault Protection Enable Register */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       PWM_ELMR[2];        /* Offset: 0x7C (R/W  32) PWM Event Line 0 Mode Register 0 */
  __I   uint8_t                        Reserved2[0x1C];
  __IO  uint32_t                       PWM_SSPR;           /* Offset: 0xA0 (R/W  32) PWM Spread Spectrum Register */
  __O   uint32_t                       PWM_SSPUP;          /* Offset: 0xA4 ( /W  32) PWM Spread Spectrum Up2025-05-27 Register */
  __I   uint8_t                        Reserved3[0x08];
  __IO  uint32_t                       PWM_SMMR;           /* Offset: 0xB0 (R/W  32) PWM Stepper Motor Mode Register */
  __I   uint8_t                        Reserved4[0x0C];
  __IO  uint32_t                       PWM_FPV2;           /* Offset: 0xC0 (R/W  32) PWM Fault Protection Value 2 Register */
  __I   uint8_t                        Reserved5[0x20];
  __O   uint32_t                       PWM_WPCR;           /* Offset: 0xE4 ( /W  32) PWM Write Protection Control Register */
  __I   uint32_t                       PWM_WPSR;           /* Offset: 0xE8 (R/   32) PWM Write Protection Status Register */
  __I   uint8_t                        Reserved6[0x44];
        pwm_cmp_registers_t            PWM_CMP[PWM_CMP_NUMBER]; /* Offset: 0x130 PWM Comparison 0 Value Register */
  __I   uint8_t                        Reserved7[0x50];
        pwm_ch_num_registers_t         PWM_CH_NUM[PWM_CH_NUM_NUMBER]; /* Offset: 0x200 PWM Channel Mode Register */
  __I   uint8_t                        Reserved8[0x180];
  __O   uint32_t                       PWM_CMUPD0;         /* Offset: 0x400 ( /W  32) PWM Channel Mode Up2025-05-27 Register (ch_num = 0) */
  __I   uint8_t                        Reserved9[0x1C];
  __O   uint32_t                       PWM_CMUPD1;         /* Offset: 0x420 ( /W  32) PWM Channel Mode Up2025-05-27 Register (ch_num = 1) */
  __I   uint8_t                        Reserved10[0x08];
  __IO  uint32_t                       PWM_ETRG1;          /* Offset: 0x42C (R/W  32) PWM External Trigger Register (trg_num = 1) */
  __IO  uint32_t                       PWM_LEBR1;          /* Offset: 0x430 (R/W  32) PWM Leading-Edge Blanking Register (trg_num = 1) */
  __I   uint8_t                        Reserved11[0x0C];
  __O   uint32_t                       PWM_CMUPD2;         /* Offset: 0x440 ( /W  32) PWM Channel Mode Up2025-05-27 Register (ch_num = 2) */
  __I   uint8_t                        Reserved12[0x08];
  __IO  uint32_t                       PWM_ETRG2;          /* Offset: 0x44C (R/W  32) PWM External Trigger Register (trg_num = 2) */
  __IO  uint32_t                       PWM_LEBR2;          /* Offset: 0x450 (R/W  32) PWM Leading-Edge Blanking Register (trg_num = 2) */
  __I   uint8_t                        Reserved13[0x0C];
  __O   uint32_t                       PWM_CMUPD3;         /* Offset: 0x460 ( /W  32) PWM Channel Mode Up2025-05-27 Register (ch_num = 3) */
} pwm_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMV71_PWM_COMPONENT_H_ */
